{"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_35j1r","retrieved_on":1485909753,"link_id":"t3_5mx70g","author":"pizzashill","score":15,"stickied":false,"gilded":0,"body":"Obamacare had a public option, and was meant to subsidize anyone that couldn't actually afford the insurance.\n\nThe republican states refused to take federal funds, that's why you saw people forced to pay for insurance they couldn't actually afford.\n\nBasically, the republicans decided Obamacare couldn't work, so they made it not work, and it still reduced premium growth and increased the insured rate.\n\nPeople in Europe have a hard time understanding this, but conservatives here are literally retarded people.\n\nIt's not just political bias on my part, they literally do not want the government to function, they do not want people to have access to healthcare or anything like that.\n\nThey aren't like conservatives in Europe that want a strong country, they want a weak country.\n\nThey run around bitching about entitlements and welfare, the kicker? They're the ones that use the most welfare, the democrats fucking pay for everything.\n\nhttps://www.brookings.edu/blog/the-avenue/2016/11/29/another-clinton-trump-divide-high-output-america-vs-low-output-america/\n\nAmerican conservatism is more about opposing literally anything liberals suggest than about running the country, it doesn't matter what the facts say.\n\nThat's why you see them denying climate change, evolution, and trying to push creationism into schools. They're just religious crazies with low mental capacity on average.\n\nI tell anyone with the means to get the fuck out of this country, it's a dumpster fire. And our entire political system is skewed towards rural America so the poor welfare leeches with low education levels run the show.\n\nhttp://www.nytimes.com/2016/11/21/upshot/as-american-as-apple-pie-the-rural-votes-disproportionate-slice-of-power.html","subreddit":"CringeAnarchy","parent_id":"t1_dc7dz5o","id":"dc7ieyq","edited":1483989595,"created_utc":1483989217,"distinguished":null}{"retrieved_on":1485909780,"subreddit_id":"t5_35j1r","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5mx70g","score":17,"author":"pizzashill","subreddit":"CringeAnarchy","gilded":0,"stickied":false,"body":"Considering people die in the US because they can't afford healthcare, not sure what makes this argument valid.\n\nDie on a wait list.\n\nDie because you can't afford care.\n\nWhich one of these is better?\n\nThe US has wait lists, we ration healthcare by ability to pay rather than time waited, this allows us to hide the extent of the problem here, make our wait times seem shorter.\n\nBefore the ACA I knew like 20 people that had not been to a doctor in over 10 years, hell, I myself, had a cyst I thought was cancer for 2 years and literally wouldn't go to the hospital because I didn't want to bankrupt.\n\nThe point is there are tons of people here that just don't go because of the costs.\n\n","parent_id":"t1_dc7gslp","id":"dc7igyp","edited":1483990556,"created_utc":1483989277,"distinguished":null}{"body":"&gt;&gt; Then you're an idiot because removing a pre-cancerous cyst in a 20 minute outpaitent procedure is a hell of a lot cheaper than cancer treatment.\n\nExcept I was like 16, and literally no, it'd cost a lot of money still.\n\n&gt;&gt; Secondly if you were broke back then most clinics/hospitals have aid programs you could have checked eligibility for.\n\nThis fantasy land you guys live in must be amazing.\n\nhttp://www.cnbc.com/id/100840148","stickied":false,"gilded":0,"subreddit":"CringeAnarchy","author":"pizzashill","score":10,"link_id":"t3_5mx70g","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"retrieved_on":1485911484,"subreddit_id":"t5_35j1r","created_utc":1483993194,"distinguished":null,"parent_id":"t1_dc7lw97","id":"dc7lzk3","edited":false}{"link_id":"t3_5mx70g","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_35j1r","retrieved_on":1485913129,"stickied":false,"body":"I mean Obamacare was intended to have a public option.\n\nNot a single republican would vote on the bill, forcing democrats to depend on conservative blue dog democrats.\n\nHad 5 republicans did the right thing we would have had a public option.\n\nThe subsidies, yeah, wasn't related to that, I was just talking about why insurance costs sky rocketed in some states.","gilded":0,"subreddit":"CringeAnarchy","author":"pizzashill","score":1,"parent_id":"t1_dc7pakv","edited":false,"id":"dc7pcx5","created_utc":1483996945,"distinguished":null}{"id":"dc7wte4","edited":false,"parent_id":"t1_dc7wmjn","distinguished":null,"created_utc":1484005889,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_35j1r","retrieved_on":1485916808,"link_id":"t3_5mx70g","author":"pizzashill","score":2,"body":"You people are literally like learning disabled, why do you constantly try to bring up \"wait lists.\"\n\nYou understand that those systems are leaps and bounds superior to ours, correct?\n\nThey are both cheaper and superior to our system.\n\nhttp://www.commonwealthfund.org/publications/fund-reports/2014/jun/mirror-mirror\n\nNow think of all the ailing children that can't afford medical care here, sound good?\n\nNot to mention the \"wait list\" arguments don't stand up to even a basic fact check.\n\nhttp://www.pnhp.org/news/2012/june/5-myths-about-canada%E2%80%99s-health-care-system","stickied":false,"gilded":0,"subreddit":"CringeAnarchy"}{"parent_id":"t1_dc7xtbk","id":"dc7xzlt","edited":false,"created_utc":1484007417,"distinguished":null,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_35j1r","retrieved_on":1485917388,"link_id":"t3_5mx70g","author":"pizzashill","score":2,"body":"You aren't understanding me, wait times in Canada aren't because of the system, it's because they try to keep costs down to an absurd level.\n\nYou should read what I linked you. \n\n\nMy other point is this: Even if there were these wait times there, that isn't relevant.\n\nThere are a ton of people in America that can't afford access to healthcare so they don't go, this is why American wait times look so short, it's because we ration healthcare based on ability to afford.\n\nLet me copy paste it because you clearly aren't interested in facts.\n\nhttp://www.pnhp.org/news/2012/june/5-myths-about-canada%E2%80%99s-health-care-system\n\n&gt;&gt; The wait times that Canada might experience are not caused by its being a single-payer system.\n\n&gt;&gt; Wait times aren’t like cancer. We know what causes wait times; we know how to fix them. Spend more money.\n\n&gt;&gt; Our single-payer system, which is called Medicare (see above), manages not to have the “wait times” issue that Canada’s does. There must, therefore, be some other reason for the wait times. There is, of course. It’s this:\n\n&gt;&gt; In 1966, Canada implemented a single-payer health care system, which is also known as Medicare. Since then, as a country, Canadians have made a conscious decision to hold down costs. One of the ways they do that is by limiting supply, mostly for elective things, which can create wait times. Their outcomes are otherwise comparable to ours.\n\n&gt;&gt; Please understand, the wait times could be overcome. Canadians could spend more. They don’t want to. We can choose to dislike wait times in principle, but they are a byproduct of Canada’s choice to be fiscally conservative.\n\n&gt;&gt; Yes, they chose this. In a rational world, those who are concerned about health care costs and what they mean to the economy might respect that course of action. But instead, they attack the system.\n\n","stickied":false,"gilded":0,"subreddit":"CringeAnarchy"}{"parent_id":"t1_dc7yark","id":"dc7ylx0","edited":false,"created_utc":1484008244,"distinguished":null,"subreddit_id":"t5_35j1r","retrieved_on":1485917691,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5mx70g","score":2,"author":"pizzashill","subreddit":"CringeAnarchy","stickied":false,"gilded":0,"body":"&gt;&gt; Its a perceived lack of affordability.\n\n**perceived**?\n\nhttp://www.cnbc.com/id/100840148\n\n??\n\n&gt;&gt; Bankruptcies resulting from unpaid medical bills will affect nearly 2 million people this year—making health care the No. 1 cause of such filings, and outpacing bankruptcies due to credit-card bills or unpaid mortgages, according to new data. And even having health insurance doesn't buffer consumers against financial hardship.\n\n&gt;&gt; The findings are from NerdWallet Health, a division of the price-comparison website. It analyzed data from the U.S. Census, Centers for Disease Control, the federal court system and the Commonwealth Fund, a private foundation that promotes access, quality and efficiency in the health-care system.\n\n&gt;&gt; \"A lot of Americans are struggling with medical bills,\" said NerdWallet Health Vice President Christina LaMontagne.\n\n&gt;&gt; NerdWallet estimates that households containing 1.7 million people will file for bankruptcy protection this year.\n\n&gt;&gt; Even outside of bankruptcy, about 56 million adults—more than 20 percent of the population between the ages of 19 and 64—will still struggle with health-care-related bills this year, according to NerdWallet Health.\n\nYou understand healthcare costs are fucking absurd here, right?\n\n&gt;&gt; The state in which I practice its illegal to deny treatment to anyone regardless of insurance.\n\nAre you talking about the ERs dude? Who do you think covers that bill in the end? This also does nothing for preventive care, which is a big problem here.\n\n\n&gt;&gt; You can lie about affordability all you want but it doesnt work.\n\nAre you just trying to like lie to yourself dude? You're a doctor right, you clearly aren't a dumb person, you understand we have mountains of empirical data showing that this claim you're making is wrong.\n\nYou need to step back and ask yourself this: Am I basing my opinion on what the facts and data say, or am I basing it on my political ideology. Because right now, as one rational person to another, literally all of the data says that healthcare costs here are out of control, you can't possibly deny that.\n\nhttp://www.pbs.org/newshour/rundown/new-peak-us-health-care-spending-10345-per-person/\n\n&gt;&gt; Myself and others know the true cost of rationed care- lives and quality of life. Still no answer- have you left yet?\n\nYet again, all empirical data shows the US healthcare system performs worse than those systems.\n\nhttp://www.commonwealthfund.org/publications/fund-reports/2014/jun/mirror-mirror\n\nCan you tell me what this says?\n\nWhy would I leave? Me disagreeing with your detachment from reality doesn't mean I leave the country, I'd rather stay here and beat the morons back."}{"parent_id":"t1_dc7ywhr","id":"dc7yzm6","edited":false,"created_utc":1484008743,"distinguished":null,"link_id":"t3_5mx70g","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1485917876,"subreddit_id":"t5_35j1r","stickied":false,"gilded":0,"body":"This is getting nuts man, again, ask yourself why you're so desperate to deny objective reality.\n\nLike this is one of the most detached things I have ever seen, and yet another time when this Alinsky quote applies perfectly, this is why you avoid political cults.\n\n&gt;&gt; I've never joined any organization—not even the ones I've organized myself. I prize my own independence too much. And philosophically, I could never accept any rigid dogma or ideology, whether it's Christianity or Marxism. One of the most important things in life is what Judge Learned Hand described as 'that ever-gnawing inner doubt as to whether you're right.' If you don't have that, if you think you've got an inside track to absolute truth, you become doctrinaire, humorless and intellectually constipated. The greatest crimes in history have been perpetrated by such religious and political and racial fanatics, from the persecutions of the Inquisition on down to Communist purges and Nazi genocide.\n\n\nYou aren't interested in what the facts say, you aren't interested in the data. You've let your political zealotry cloud your judgement.","subreddit":"CringeAnarchy","author":"pizzashill","score":2}{"stickied":false,"body":"&gt;&gt; You dont know my politics and youre too naive to understand that data can be bought and paid for.\n\nRight, when the data says you're wrong, the data must be shilling!\n\nCome on man, this is pathetic.\n\n&gt;&gt; Now can you answer my previous questions? Bonus points if you can do so with independent thought...\n\nYour question is fucking drivel dude, me pointing out the data says you're wrong doesn't mean I leave the country.\n\nMe pointing out problems in America doesn't mean I should leave America.\n\nThis is probably the most anti-American thing I've ever seen anyone say, it's the last refuge of a low mental capacity conservative that can't handle the fact objective reality conflicts with his dogmatic cult.","gilded":0,"subreddit":"CringeAnarchy","author":"pizzashill","score":3,"link_id":"t3_5mx70g","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_35j1r","retrieved_on":1485917992,"distinguished":null,"created_utc":1484009059,"edited":false,"id":"dc7z8b1","parent_id":"t1_dc7z54s"}{"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_35j1r","retrieved_on":1485918160,"link_id":"t3_5mx70g","author":"pizzashill","score":1,"gilded":0,"stickied":false,"body":"&gt;&gt; Hahaha I get it now. You encourage people to leave the country then criticize me for asking why you havent\n\nI tell people to leave, that doesn't mean they should, it doesn't mean I should.\n\n&gt;&gt; quote saul alinski like he was a moral saint.\n\nNo, I copy pasted something he said that is absolutely true, but nice try.\n\n&gt;&gt; Youve totally ignored all my points\n\nEvery single point you made was proven wrong with actual data.\n\n&gt;&gt; you even think all studies are facts. Grow up\n\n\"studies and data prove my opinions wrong, that means the studies and data are fake.\"\n\n#conservatism.\n","subreddit":"CringeAnarchy","id":"dc7zksu","edited":false,"parent_id":"t1_dc7zhud","distinguished":null,"created_utc":1484009517}{"created_utc":1484009629,"distinguished":null,"parent_id":"t1_dc7zmg2","id":"dc7znzx","edited":false,"author":"pizzashill","score":1,"stickied":false,"body":"Holy shit, are you actually a doctor dude? This outright denial of data and studies because they conflict with your worldview is just alarming.\n\nThis is one of the most anti-intellectual things I've ever seen.\n\nThis is how shit like this happens: https://en.wikipedia.org/wiki/Lysenkoism\n","gilded":0,"subreddit":"CringeAnarchy","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_35j1r","retrieved_on":1485918204,"link_id":"t3_5mx70g"}{"score":6,"author":"pizzashill","subreddit":"WTF","stickied":false,"gilded":0,"body":"Lol, don't compare these people to MRAs. A lot of high up MRAs supported Clinton.\n\nBeing an MRA, at least a rational one, means you have to accept systemic discrimination in the justice/education system, something that conflicts with many Trumptards.","subreddit_id":"t5_2qh61","retrieved_on":1485919394,"controversiality":1,"author_flair_css_class":null,"author_flair_text":null,"link_id":"t3_5mzaro","created_utc":1484012707,"distinguished":null,"parent_id":"t1_dc7vqbj","edited":false,"id":"dc823ve"}{"author":"pizzashill","score":8,"gilded":0,"stickied":false,"body":"I used to be pretty bad about this kind of stuff, even today, as a hardcore skeptic I'll hear something I want to be true and caught up in the moment I'll believe it before reality kicks in.\n\nFor example, the other day my mom read a fake news article off about how Scientology lost tax exempt status and I cheered for about 25 seconds before applying critical thought.\n\nPolitics is another example, I've removed myself from any political groups because I don't want my identity to get caught up in politics or my views, but I'm clearly on the left side of the spectrum and sometimes I'm a little too quick on judgments there.\n\n","subreddit":"skeptic","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qj8f","retrieved_on":1485919858,"link_id":"t3_5n1yme","created_utc":1484013858,"distinguished":null,"parent_id":"t3_5n1yme","id":"dc8326x","edited":false}{"parent_id":"t1_dc8374g","edited":false,"id":"dc83e7r","created_utc":1484014255,"distinguished":null,"link_id":"t3_5n1yme","subreddit_id":"t5_2qj8f","retrieved_on":1485920020,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"skeptic","body":"I mean it happens in politics mainly.\n\nMy wording is questionable sometimes.\n\nI'll go on a rant about how \"dumb rural America is\" forgetting to make it clear I don't believe ALL of rural America is dumb, stuff like that.\n\n","stickied":false,"gilded":0,"score":5,"author":"pizzashill"}{"link_id":"t3_5n6en6","subreddit_id":"t5_2qj8f","retrieved_on":1485938730,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"skeptic","gilded":0,"stickied":false,"body":"\"Vaccine critic.\"\n\n\"Vaccine skeptic.\"\n\nYeah, just like these guys were \"biology critics\" and \"biology skeptics.\"\n\nhttps://en.wikipedia.org/wiki/Lysenkoism\n\n","score":3,"author":"pizzashill","edited":false,"id":"dc95amg","parent_id":"t3_5n6en6","distinguished":null,"created_utc":1484076730}{"subreddit":"worldnews","body":"I'd love to see the gymnastics behind the claim their jets are more reliable than US jets.\n\nEven tanks, hell, even firearms. \n\nI don't really know anything about helicopters, but I suspect the claim Russian helicopters are more reliable is dubious at best.\n\nUS fighters though are absolutely superior to Russian fighters.\n\nIn the firearm department I can only assume this is AK fanboyism.\n\nThere's a common trend where people will attack US military technology, people did it to the f-16, the f-22, the Abrams, now the f-35.\n\nYet these platforms always end up being superior.","stickied":false,"gilded":0,"score":5,"author":"pizzashill","link_id":"t3_5n4k19","subreddit_id":"t5_2qh13","retrieved_on":1485941762,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"distinguished":null,"created_utc":1484083630,"id":"dc9bgzl","edited":1484083860,"parent_id":"t1_dc98mv2"}{"link_id":"t3_5n4k19","subreddit_id":"t5_2qh13","retrieved_on":1485944834,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"worldnews","gilded":0,"stickied":false,"body":"I mean, history has shown AA is just a speed bump, at some point, fighters and bombers will get through.\n\nThere's been a war between the sword and the shield for most of human history, and the sword always wins.","score":3,"author":"pizzashill","parent_id":"t1_dc9gva2","edited":false,"id":"dc9hpoi","created_utc":1484091798,"distinguished":null}{"link_id":"t3_5n4k19","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1485965576,"body":"Uh, you won't really be losing fighters at some insane rate.","stickied":false,"gilded":0,"subreddit":"worldnews","author":"pizzashill","score":1,"parent_id":"t1_dcaflyv","edited":false,"id":"dcanu73","created_utc":1484159032,"distinguished":null}{"stickied":false,"body":"With any luck he'll be kicked to the curb or stroke out soon.","gilded":0,"subreddit":"Drama","author":"pizzashill","score":4,"link_id":"t3_5nc9lt","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2rd2l","retrieved_on":1485967059,"distinguished":null,"created_utc":1484162348,"edited":false,"id":"dcaqu29","parent_id":"t1_dcab450"}{"score":7,"author":"pizzashill","subreddit":"Drama","body":"I'm fond of having a functioning economy and clean air/water.\n\nNo drama is worth losing those things.","stickied":false,"gilded":0,"retrieved_on":1485967140,"subreddit_id":"t5_2rd2l","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5nc9lt","distinguished":null,"created_utc":1484162529,"id":"dcaqzx1","edited":false,"parent_id":"t1_dcadryk"}{"created_utc":1484162673,"distinguished":null,"parent_id":"t1_dcamq5y","id":"dcar4mq","edited":false,"subreddit":"Drama","stickied":false,"body":"There was a huge influx of people from the Donald calling people \"mentally ill\" for believing the intel report.\n\nThe same fucking people that not even a month ago were convinced Clinton was running a satanic pedo cult out of a pizza parlor.\n\nThese people literally live on fake news, they're the most selectively skeptical people I've ever seen in my life.","gilded":0,"score":30,"author":"pizzashill","link_id":"t3_5nc9lt","subreddit_id":"t5_2rd2l","retrieved_on":1485967206,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null}{"link_id":"t3_5n4k19","subreddit_id":"t5_2qh13","retrieved_on":1485971555,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit":"worldnews","stickied":false,"body":"You understand that countries don't just fly planes into air defenses, correct?\n\nThis seems to be a very naive understanding of the subject at hand, it's like you think people just run into walls and die until the wall is gone.\n\nThe US has been playing this game with Russia for a long time, US fighters vs Russian air defenses, and the US always wins.\n\nWe have multiple conflicts showing this, and stealth has only tilted the advantage more in favor of air power.\n","gilded":0,"score":2,"author":"pizzashill","parent_id":"t1_dcazs7q","edited":1484172450,"id":"dcazwpx","created_utc":1484172228,"distinguished":null}{"author":"pizzashill","score":2,"gilded":0,"stickied":false,"body":"&gt;&gt; You do understand that the US army expects and relies on air support right? They haven't fought a major enemy without total air superiority since WW2. Without air or naval support, the USA and Russia are on parity in their capabilities.\n\nThis is basically incoherent, why is it you think air support won't be involved? You seem to think that air defenses = no air power ever, no matter what.\n\nLike I said, air defenses are a speed bump at most.\n\nAs for the rest of this, what is it you're saying? Without a navy or air power they're on parity? Wtf? That's like saying without bullets a knife is on par with a gun or something.\n\nThe US economy is many times larger than the Russian economy, the US has much better logistical support, higher production, everything.\n\n&gt;&gt; The US airforce has never fought current Russian Air defenses. The newest system that is sold to other countries is the S-300 which is 2 generations old.\n\nUh, you have old US jets vs old russian air defenses, if new US jets perform on par, or better (probably better) than we can expect the same thing to happen.\n\n&gt;&gt; Also, stealth only reduces your radar cross-section. That doesn't help when it's still visible.\n\nLol...\n","subreddit":"worldnews","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1485974638,"link_id":"t3_5n4k19","distinguished":null,"created_utc":1484179965,"edited":false,"id":"dcb66ik","parent_id":"t1_dcb5r5a"}{"score":9,"author":"pizzashill","subreddit":"amiugly","stickied":false,"body":"You are not overweight at all, not even close.","gilded":0,"retrieved_on":1485978139,"subreddit_id":"t5_2rgjh","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5ngmub","created_utc":1484189420,"distinguished":null,"parent_id":"t3_5ngmub","edited":false,"id":"dcbdass"}{"subreddit_id":"t5_2rgjh","retrieved_on":1485978186,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5ngmub","score":7,"author":"pizzashill","subreddit":"amiugly","gilded":0,"stickied":false,"body":"Your face/arms aren't fat though. \n\nIt's actually pretty even, better than most people.\n\nI get with the body issues you might still feel this way, no matter what I say to you (my ex had the same thing) but I can tell you right now you do not have a fat face/arms.","parent_id":"t1_dcbdcwp","id":"dcbdeep","edited":false,"created_utc":1484189556,"distinguished":null}{"distinguished":null,"created_utc":1484194992,"edited":1484195269,"id":"dcbherw","parent_id":"t1_dcbfr28","subreddit":"worldnews","body":"no, I mean, you're just not educated enough on this subject to have any real discussion.\n\nIt's like trying to explain physics to a child or something, you're literally just not understanding modern warfare, air defenses, or how planes work.","stickied":false,"gilded":0,"score":2,"author":"pizzashill","link_id":"t3_5n4k19","subreddit_id":"t5_2qh13","retrieved_on":1485980123,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null}{"created_utc":1484205327,"distinguished":null,"parent_id":"t1_dcbb77x","id":"dcbn6g7","edited":false,"score":10,"author":"pizzashill","subreddit":"news","stickied":false,"gilded":0,"body":"I don't know how to break this to you, but this confirms everything progressives have been saying for years.\n\nIf this is true, it basically destroys the race/IQ argument which was already on its last leg.\n\nIt destroys \"that was a long time ago\" as well.","retrieved_on":1485982940,"subreddit_id":"t5_2qh3l","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5ng09v"}{"retrieved_on":1485985013,"subreddit_id":"t5_2rd2l","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5nc9lt","score":1,"author":"pizzashill","subreddit":"Drama","gilded":0,"stickied":false,"body":"&gt;&gt; If you don't believe that Trump hires Russian prostitutes to piss on beds Obama slept in than you obviously believe that Clinton is running a satanic pedo cult out of a pizza parlor. \n\nThat's not the implication, in fact, you seem to have fabricated that part.\n\nI don't know if the report is true or false, I don't believe things with no real proof.\n\nThat doesn't change the fact Donald tards are gullible, uneducated twats that are selectively skeptic.\n\n&gt;&gt; The truth is CNN and Buzzfeed have proven that their journalism standards are every bit as shitty as Breitbart and Infowars. Not even the NYT is willing to touch this story without a ten foot pole that has \"unsubstantiated\" written all over it.\n\nYeah, claiming CNN or buzzfeed is as bad as info wars is basically mental illness, that is an absurd, divorced from reality claim.\n\n&gt;&gt; Seriously though, have you been watching CNN? They're backpedaling so hard right now. Van Jones premiered his new show with a five minute diatribe about how horrible the \"salacious allegations\" being thrown around are, and how people shouldn't believe everything they hear.\n\nAgain, I literally don't give a shit about CNN, and they aren't even backpedaling, they literally reported on something existing, nothing more. \n\nIt wasn't \"fake news\" and frankly I don't even care anymore, I hope they lie and smear Trump every single day for the next 4 years because it's what he fucking deserves.\n\nThe man is a walking fake news creator, he's gone on the Alex Jones show, he spreads conspiracies about people constantly.\n\nKarma is a bitch.\n\n&gt;&gt; Don Lemon's show was straight up throwing Buzzfeed under the bus by repeatedly reminding viewers that CNN only reported on the existence of the allegations; they weren't the ones who said what those allegations actually were. That dossier was opposition research on Trump so outrageously unverifiable that not even the Clinton campaign was willing to go there. CNN knows they done fucked up.\n\nSee above.\n\n**Good.**\n\nSmear him, every single claim made about Donald Trump should be taken seriously, because it's what he deserves, no matter how little evidence.\n\nHe walks around spinning conspiracies constantly about other people, maybe he should stop being a cock sucking cuck and man up.\n\nMaybe he should have thought about that before he ran around smearing people for years.\n\nBefore he hired Keefe to frame the DNC.\n\nI hope he gets attacked every fucking day of his life from here on out, with the most vicious smears possible and I hope it makes him stroke out.","id":"dcbrb8q","edited":false,"parent_id":"t1_dcbqsj3","distinguished":null,"created_utc":1484216746}{"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1485995492,"link_id":"t3_5n4k19","author":"pizzashill","score":2,"stickied":false,"gilded":0,"body":"&gt;&gt; Translation: I don't know what I'm talking about and need to end the conversation.\n\nI can assure you that you're absolutely clueless, here, let me help you out.\n\nhttps://www.reddit.com/r/CredibleDefense/\n\nThe real translation here is \"I'm not going to argue with an armchair general that has no understanding of air defenses or airplanes.\"\n\nI'll just link you a sub where defense industry people hang out so you can educate yourself.","subreddit":"worldnews","id":"dcccqv3","edited":1484248927,"parent_id":"t1_dcc0ey2","distinguished":null,"created_utc":1484248617}{"link_id":"t3_5nc9lt","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2rd2l","retrieved_on":1485995593,"stickied":false,"body":"Trump lost the right to true news when he pandered to a post-fact society.","gilded":0,"subreddit":"Drama","author":"pizzashill","score":1,"parent_id":"t1_dcbroi0","edited":false,"id":"dcccyd1","created_utc":1484248849,"distinguished":null}{"created_utc":1484249180,"distinguished":null,"parent_id":"t1_dccd4av","id":"dccd9ag","edited":false,"score":1,"author":"pizzashill","subreddit":"worldnews","stickied":false,"body":"I linked you a subreddit populated with people from the defense industry, a very good sub for stuff like this.\n\nI have no problem with you, but if you're actually interested in defense you should check that sub out, there are real experts there and fantastic sources.\n\nI just don't have the patience for these arguments anymore. ","gilded":0,"subreddit_id":"t5_2qh13","retrieved_on":1485995741,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5n4k19"}{"created_utc":1484249514,"distinguished":null,"parent_id":"t1_dccdijz","edited":false,"id":"dccdkd7","author":"pizzashill","score":1,"stickied":false,"body":"I won't be lied to, I have the ability to fact check things said in the media, I'm actually just interested in the media bamboozling a bunch of far lefties to the point they show up and actually vote.\n\nIt works for conservatives, why can't it work for the left?\n\nThe GOP spent 8 years lying about Obama, time to return the favor.","gilded":0,"subreddit":"Drama","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2rd2l","retrieved_on":1485995891,"link_id":"t3_5nc9lt"}{"distinguished":null,"created_utc":1484251541,"edited":false,"id":"dccfe56","parent_id":"t1_dccf9p6","subreddit":"Drama","stickied":false,"gilded":0,"body":"I wasn't talking about me, you mongoloid, I was talking about the media.","score":1,"author":"pizzashill","link_id":"t3_5nc9lt","subreddit_id":"t5_2rd2l","retrieved_on":1485996786,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null}{"subreddit":"Drama","gilded":0,"stickied":false,"body":"Do you think media is where things are fact checked, or something?\n\nAnd no, I want a complete lack for journalistic  integrity because it's payback time, what goes around comes around.","score":1,"author":"pizzashill","link_id":"t3_5nc9lt","subreddit_id":"t5_2rd2l","retrieved_on":1485996937,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"created_utc":1484251895,"distinguished":null,"parent_id":"t1_dccfmse","id":"dccfphp","edited":false}{"author":"pizzashill","score":9,"stickied":false,"gilded":0,"body":"Well, they're woke, not sheeple like us normies.","subreddit":"conspiratard","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2r2dd","retrieved_on":1486027156,"link_id":"t3_5nmnv2","created_utc":1484343422,"distinguished":null,"parent_id":"t1_dcdplpp","edited":false,"id":"dce69k0"}{"id":"dcemare","edited":1484367213,"parent_id":"t1_dcelxxv","distinguished":null,"created_utc":1484366641,"link_id":"t3_5nv73m","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486035014,"stickied":false,"body":"Dude the best part of this entire thing was watching the factions going at it with each other in various right wing circles.\n\nWhen Trump started putting Goldman Sachs jews in charge of the government the more hard-core white nationalists went bonkers.\n\nThen the more soft-core white nationalists tried to pull the most extreme gymnastics possible to defend it.\n\nTrump's base is the \"info wars\" crowd, everything he's doing/done conflicts with their entire worldview, they have to either turn on him or admit they're crazy.","gilded":0,"subreddit":"worldnews","author":"pizzashill","score":186}{"score":14,"author":"pizzashill","subreddit":"worldnews","stickied":false,"body":"There are a few reasons people voted for Trump.\n\nA) Blind party loyalty.\n\nB) A lack of education.\n\nC) Nationalistic xenophobia.\n\nD) heavily misinformed on macroeconomics, which would tie into B)\n\nE) Religious, which is just dumb overall.","gilded":0,"subreddit_id":"t5_2qh13","retrieved_on":1486037097,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5nv73m","created_utc":1484374515,"distinguished":null,"parent_id":"t1_dceqdqu","edited":false,"id":"dceqgps"}{"edited":false,"id":"dcer9ch","parent_id":"t1_dcer8lc","distinguished":null,"created_utc":1484376305,"subreddit_id":"t5_2qh13","retrieved_on":1486037489,"controversiality":1,"author_flair_css_class":null,"author_flair_text":null,"link_id":"t3_5nv73m","score":3,"author":"pizzashill","subreddit":"worldnews","stickied":false,"body":"&gt;&gt; But what about the people who voted for one of the reasons you listed. You suddenly know every single person that voted for him? I don't think so. I can make fake lists too.\n\nAlright, let's put this to the test.\n\nCan you provide a single reason to vote for Donald Trump that isn't religion, subjective, and is actually based on empirical data?","gilded":0}{"id":"dcerdwg","edited":false,"parent_id":"t1_dcerc1z","distinguished":null,"created_utc":1484376599,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"retrieved_on":1486037550,"subreddit_id":"t5_2qh13","link_id":"t3_5nv73m","author":"pizzashill","score":7,"body":"Facts are not subjective, I asked you for reasons based on empirical data, not feelings.\n\n","stickied":false,"gilded":0,"subreddit":"worldnews"}{"edited":false,"id":"dcergno","parent_id":"t1_dcerfl2","distinguished":null,"created_utc":1484376782,"link_id":"t3_5nv73m","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486037586,"gilded":0,"stickied":false,"body":"Lol what?\n\nI listed off multiple things that can be fact checked, economics, for example.\n\nSo you understand everyone here can see you can't actually provide a fact based reason for supporting Trump, right?","subreddit":"worldnews","author":"pizzashill","score":9}{"parent_id":"t1_dcerj6h","id":"dcerjvi","edited":false,"created_utc":1484376996,"distinguished":null,"subreddit_id":"t5_2qh13","retrieved_on":1486037630,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5nv73m","score":1,"author":"pizzashill","subreddit":"worldnews","body":"Ok, so let's ask this one more time.\n\nCan you provide a single logical reason to support Trump, based on empirical data.\n\nFor example, which policy choices did Trump run on that are sound?","stickied":false,"gilded":0}{"link_id":"t3_5nv73m","subreddit_id":"t5_2qh13","retrieved_on":1486037688,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit":"worldnews","stickied":false,"body":"I understand it's an ad hominem in place of a valid argument, that's about it.","gilded":0,"score":1,"author":"pizzashill","id":"dcero4a","edited":false,"parent_id":"t1_dcern7a","distinguished":null,"created_utc":1484377281}{"link_id":"t3_5nv73m","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486037710,"stickied":false,"gilded":0,"body":"There are different degrees of white nationalist.\n\nYou have cultural white nationalists which mainly operate on \"protecting western culture.\"\n\nThen you have the neo-nazi ones that literally think other races should be wiped out. Extreme eugenics, stuff like that.","subreddit":"worldnews","author":"pizzashill","score":42,"parent_id":"t1_dcerof1","id":"dcerprd","edited":false,"created_utc":1484377395,"distinguished":null}{"link_id":"t3_5nv73m","subreddit_id":"t5_2qh13","retrieved_on":1486037804,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"worldnews","gilded":0,"stickied":false,"body":"How can you possibly know how I'm going to respond to you?\n\nHow people feel and what is true are two different things. You understand this, correct?\n\nEven here:\n\n&gt;&gt;  Some people like Donald Trumps stance on VA reform which makes sure veterans get better care. \n\nWhat VA stance?\n\nLink me his fully laid out plan on how he's going to reform the VA.\n\n&gt;&gt; Or that he wants to further strengthen our military. \n\nOur military that's already stronger than every other country on the earth?\n\nTrump has already attacked the f-35 and talked about bringing the god damn battleship back, how does this make us stronger?\n\nIt's likely his shit will make our military **weaker** because he's shown he can't listen to experts.\n\n&gt;&gt;  One of Donald Trumps policies involved giving 6 weeks paid maternity\n\nClinton had the same.\n\n&gt;&gt; incentivizing businesses to provide day care.\n\nClinton had the same.\n\n&gt;&gt; People maybe like those. \n\nSo like I said, people that aren't very educated on the issues.\n","score":2,"author":"pizzashill","parent_id":"t1_dcersvu","id":"dcerwnm","edited":false,"created_utc":1484377869,"distinguished":null}{"stickied":false,"gilded":0,"body":"&gt;&gt; Right there on his website bud just like everything else I posted.\n\nHe didn't provide a plan, he literally just said he was going to do x, this is common with Trump.\n\n\"IT'LL BE GREAT, TRUST ME, I DON'T KNOW HOW, BUT IT WILL.\"\n\n&gt;&gt; Oh boy people because people are different means they're uneducated. Totally not a bigot.\n\nhttp://fivethirtyeight.com/features/education-not-income-predicted-who-would-vote-for-trump/\n","subreddit":"worldnews","author":"pizzashill","score":4,"link_id":"t3_5nv73m","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"retrieved_on":1486037884,"subreddit_id":"t5_2qh13","created_utc":1484378280,"distinguished":null,"parent_id":"t1_dces1eh","id":"dces2gs","edited":false}{"distinguished":null,"created_utc":1484378320,"edited":false,"id":"dces31h","parent_id":"t1_dces28s","author":"pizzashill","score":1,"stickied":false,"gilded":0,"body":"Yeah, I forgot, yikes.","subreddit":"worldnews","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486037892,"link_id":"t3_5nv73m"}{"created_utc":1484378594,"distinguished":null,"parent_id":"t1_dces4rc","edited":false,"id":"dces6vu","author":"pizzashill","score":3,"stickied":false,"body":"Small?\n\nLiterally the largest gap was low education white voters, they are why Trump won.\n\nHe won whites with no college education by like 40 fucking percent.","gilded":0,"subreddit":"worldnews","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486037944,"link_id":"t3_5nv73m"}{"parent_id":"t1_dces8uw","id":"dces9q3","edited":false,"created_utc":1484378796,"distinguished":null,"subreddit_id":"t5_2qh13","retrieved_on":1486037983,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5nv73m","score":1,"author":"pizzashill","subreddit":"worldnews","stickied":false,"gilded":0,"body":"But you didn't really make one, those arguments you made aren't supported by facts.\n\nThey're based on feelings, the military bit is a good example of this."}{"edited":false,"id":"dcesdmp","parent_id":"t1_dcesbi1","distinguished":null,"created_utc":1484379084,"link_id":"t3_5nv73m","retrieved_on":1486038036,"subreddit_id":"t5_2qh13","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit":"worldnews","stickied":false,"body":"I don't think all Trump supporters are racist, most of them are just stupid people, factually.\n\nSam Harris actually explains why.\n\nhttps://www.youtube.com/watch?v=Az1JyDJ_iKU\n\nAnyone that voted for a climate denier, anti-vaxxer, Alex Jones conspiratard is just not smart.","gilded":0,"score":1,"author":"pizzashill"}{"score":2,"author":"pizzashill","subreddit":"worldnews","stickied":false,"body":"I'm just saying, the guy is an Alex Jones conspiratard.\n\nYou've endangered us all, and you need to live with that.","gilded":0,"retrieved_on":1486038293,"subreddit_id":"t5_2qh13","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5nv73m","created_utc":1484380550,"distinguished":null,"parent_id":"t1_dcesgx1","id":"dceswqo","edited":false}{"created_utc":1484380807,"distinguished":null,"parent_id":"t1_dcesyfq","edited":false,"id":"dcet01c","stickied":false,"body":"No, a bunch of people, combined, did.","gilded":0,"subreddit":"worldnews","author":"pizzashill","score":2,"link_id":"t3_5nv73m","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486038338}{"link_id":"t3_5nv73m","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486038394,"stickied":false,"body":"Trump told you what he wanted to do, you understand this, right?\n\nLike these aren't subjective things.\n\nThe man is putting an anti-vaxxer in charge of vaccine safety.\n\nClimate deniers in charge of the EPA.\n\nHe's trying to deregulate the banks and slash taxes on the wealthy.\n\nHe put a creationist in charge of education.\n\nHow the hell are these not setting off alarm bells for you?","gilded":0,"subreddit":"worldnews","author":"pizzashill","score":2,"parent_id":"t1_dcet0rh","edited":false,"id":"dcet467","created_utc":1484381132,"distinguished":null}{"created_utc":1484381315,"distinguished":null,"parent_id":"t1_dcet5jd","id":"dcet6fq","edited":false,"score":2,"author":"pizzashill","subreddit":"worldnews","gilded":0,"stickied":false,"body":"&gt;&gt; He did that after the election, nothing I can do. Can't go back in time and change my vote.\n\nBut he said he was going to do all of this before the election, all of these are well known, public stances from Donald Trump.\n\nI'm baffled here, it's like those people in rural America that are in a panic right now because they're going to lose health insurance after voting for a man that literally told them this was going to happen.\n\nI feel like I'm being trolled here, he does exactly the things he's been saying he's going to do, and that's a curve ball?","subreddit_id":"t5_2qh13","retrieved_on":1486038424,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5nv73m"}{"parent_id":"t1_dcev4r7","edited":false,"id":"dcev5p1","created_utc":1484387649,"distinguished":null,"subreddit_id":"t5_2qh13","retrieved_on":1486039396,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5nv73m","score":4,"author":"pizzashill","subreddit":"worldnews","body":"I didn't say they were some huge bastion, but they're all over the internet.\n\nTrump's base is more so dumb than racist.","stickied":false,"gilded":0}{"subreddit":"worldnews","stickied":false,"body":"I'd rather lose a hundred elections than coddle dumb people.\n\nI'd rather be right than win elections, these people are dumb, factually.\n\nThat's why you see them crying about how they're losing health insurance after voting for someone that told them he'd take it away.\n\nBorderline learning disability.","gilded":0,"score":4,"author":"pizzashill","link_id":"t3_5nv73m","subreddit_id":"t5_2qh13","retrieved_on":1486039460,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"created_utc":1484388104,"distinguished":null,"parent_id":"t1_dcev9qa","edited":false,"id":"dcevabg"}{"link_id":"t3_5nv73m","subreddit_id":"t5_2qh13","retrieved_on":1486051703,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"worldnews","stickied":false,"gilded":0,"body":"I see, so we don't need healthcare really, who cares about the millions of people that will lose coverage and suffer.\n\nObamacare might not have been perfect, but it slowed premium growths and increased the insured rate, many countries have an insurance mandate.\n\n","score":1,"author":"pizzashill","parent_id":"t1_dcewwpl","edited":false,"id":"dcfk1mp","created_utc":1484431837,"distinguished":null}{"subreddit":"worldnews","stickied":false,"body":"https://www.youtube.com/watch?v=FJqLAleEnKw\n\n","gilded":0,"score":1,"author":"pizzashill","link_id":"t3_5nv73m","subreddit_id":"t5_2qh13","retrieved_on":1486051713,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"distinguished":null,"created_utc":1484431864,"edited":false,"id":"dcfk2f5","parent_id":"t1_dcewvqa"}{"stickied":false,"body":"I do, every bit as much as I do about cancer SJW identity politics, both are just as bad.","gilded":0,"subreddit":"worldnews","author":"pizzashill","score":0,"link_id":"t3_5nv73m","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486051722,"distinguished":null,"created_utc":1484431886,"id":"dcfk31h","edited":false,"parent_id":"t1_dcewg37"}{"distinguished":null,"created_utc":1484433657,"edited":false,"id":"dcflhvy","parent_id":"t1_dcf3b2q","score":17,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"This story sounds like bullshit, tbh, when I read this part I started to suspect it's false:\n\n&gt;&gt; \"My daughter saw another worker put her (menstrual fluids) and lick cheese that went on a customer's burger. **My daughter told the (assistant manager) that was on duty and the (assistant manager) still brought the food out to the customer!!!**  We called the store to try and talk to the general manager and they wouldn't give her the numbers to get a hold of a manager. We then called corporate who again did nothing!! They called my daughter in (Tuesday) and told her she was to resign or quit when she asked why they told her because her family made false reports!\" her post reads.  \n\n\nSeems highly questionable.","retrieved_on":1486052434,"subreddit_id":"t5_2qh3l","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5nxyas"}{"edited":false,"id":"dcfusnq","parent_id":"t1_dcfuocm","distinguished":null,"created_utc":1484445713,"link_id":"t3_5nv73m","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486057086,"stickied":false,"body":"&gt;&gt; Obamacare did nothing to address the primary issue in healthcare which is costs. It just forced people like me to overpay in order to subsidize others.\n\nhttp://talkingpointsmemo.com/dc/health-care-spending-growth-urban-institute-study\n\n&gt;&gt; I am certainly not alone in my dislike of Obamacare. Take a gander at the number of Democrat elected officials to all posts pre and post Obamacare. \n\nYou mean the extreme gerrymandering, which happened before Obamacare was even law?\n\nhttp://election.princeton.edu/2012/12/30/gerrymanders-part-1-busting-the-both-sides-do-it-myth/\n\n&gt;&gt; I still can't believe Democrats haven't turned on Obama. His attempt to create a legacy via upheaval to the healthcare system will ensure the Democrats are a minority party in congress for a decade or more.\n\nYeah, clearly the fault of Obama, not the extreme gerrymandering, racial voter suppression or anything, it was Obama.\n\nPeople like you are why this country is just going to fail, and maybe that's for the best. You'd rather go bankrupt than have a functioning healthcare system.\n\nThe republican party thinks math and fact are biased against them, in the end, we'll fail, and maybe the western world will keep progressing without us.","gilded":0,"subreddit":"worldnews","author":"pizzashill","score":1}{"link_id":"t3_5nv73m","retrieved_on":1486057582,"subreddit_id":"t5_2qh13","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"worldnews","body":"&gt;&gt; You can deflect to gerrymandering and race \n\nAlso known as an objective god damn fact?\n\nI'm starting to suspect the reason why only 6% of scientists are republican and uneducated voters flock towards the GOP is a serious intelligence problem.\n\nThere's something about right wing ideology that just attracts the  lowest common denominator. it's like a learning disability of some form.\n\n\n&gt;&gt; Obama said that the average family would see savings of up to $2500 a year. That was total bullshit and the voters reacted. Inexplicably to me, somehow Obama doesn't get any of the blame for the whole thing but the Democratic party has been the one that has been punished and punished severely.\n\n- Obamacare reduced healthcare costs.\n\n- Obamacare increased insured rate.\n\nAre these statements true or false?","stickied":false,"gilded":0,"score":1,"author":"pizzashill","edited":false,"id":"dcfvswo","parent_id":"t1_dcfvr1c","distinguished":null,"created_utc":1484447029}{"author":"pizzashill","score":1,"gilded":0,"stickied":false,"body":"This fallacious thinking is just getting out of control.\n\n&gt;&gt; If Republicans are such idiots then why are the Democrats losing so badly on a national level? It seems like it should be easy to win with all the extra intelligence. How hard can it be to convince a bunch of dumbasses to vote for you?\n\nThe democrats are god awful at manipulating stupid people, and the GOP has literally built their brand by creating an anti-fact bubble you can find all over rural America.\n\nhttp://talkingpointsmemo.com/livewire/charlie-sykes-conservative-media-created-trump-monster\n\n\n\n&gt;&gt; The problem the Democrats faced was that even a dumbass can tell that insurance premiums were increasing and coverage was decreasing as the deductibles went sky high. Out of pocket costs went up for a sizable chunk of the population. This did not match with the promise of a savings of up to $2500 in healthcare costs for the average family.\n\nTHE GROWTHS WERE SLOWER POST OBAMACARE THAN PRE-OBAMACARE, LOL.\n\n&gt;&gt; The Democrats were holding their own until 2010. Then the bottom dropped out. That is why I am convinced that Obamacare was the issue that has decimated the Democrats. But then again, I'm just a dumbass Republican so what do I know...\n\n\nAnd I already gave you data showing extreme gerrymandering, not sure what's hard to grasp about this, here's some more data.\n\nhttps://www.brookings.edu/blog/the-avenue/2016/11/29/another-clinton-trump-divide-high-output-america-vs-low-output-america/\n\nhttp://fivethirtyeight.com/features/education-not-income-predicted-who-would-vote-for-trump/\n\nLike you people don't seem to realize the problem here, dumb ass people eat GOP doctrine up, they don't like education, they don't like facts. They're just a cancer on society and will always be a cancer on society.\n\nThis is why I don't want to live in a union anymore, I'd love nothing more than for blue states to just leave the union and let the southern welfare states collapse.\n\n**We can build a wall.**\n\nIf the GOP wants a 3rd world country, let them have a 3rd world country.","subreddit":"worldnews","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486058220,"link_id":"t3_5nv73m","created_utc":1484448711,"distinguished":null,"parent_id":"t1_dcfwvz4","edited":1484449088,"id":"dcfx2ev"}{"distinguished":null,"created_utc":1484450029,"id":"dcfy0es","edited":false,"parent_id":"t1_dcfxt20","author":"pizzashill","score":1,"body":"&gt;&gt; Again, I don't get how the smartest people in America can't figure out how to out-manipulate the Republicans in order to win the votes of the dumbest people in America. It just seems crazy to me that you guys are so much smarter yet aren't able to come up with a winning strategy to convince a bunch of mouth-breathing morons to vote for you.\n\nDude, this is hilarious, you need to look into gerrymandering, it is out of control, it is absurd.\n\nhttp://www.indiewire.com/2017/01/democracy-for-sale-zach-galifianakis-gerrymandering-documentary-clip-1201769162/\n\nOr we can go look at the NPR article:\n\nhttp://www.npr.org/2016/06/15/482150951/understanding-congressional-gerrymandering-its-moneyball-applied-to-politics\n\n&gt;&gt; **DALEY: The idea was that you could take a state like Ohio, for example. In 2008, the Democrats held a majority in the statehouse of 53-46. What RedMap does is they identify and target six specific statehouse seats. They spend $1 million on these races, which is an unheard of amount of money coming into a statehouse race. Republicans win five of these. They take control of the Statehouse in Ohio - also, the state Senate that year. And it gives them, essentially, a veto-proof run of the entire re-districting in the state.**\n\n&gt;&gt; **So in 2012, when Barack Obama wins again and he wins Ohio again, and Sherrod Brown is re-elected to the Senate by 325,000 votes, the Democrats get more votes in statehouse races than the Republicans. But the lines were drawn so perfectly that the Republicans held a 60-39 supermajority in the House of Representatives, despite having fewer votes.**\n\n\nThe people running the GOP aren't stupid, they aren't uneducated. Their base is, and they're better at manipulating that base.\n\n&gt;&gt; Gerrymandering doesn't account for the complete collapse of the party. Sorry but take a look again at the article I linked. The losses were not only in the house but also the senate as well as in state legislatures and governors. That's not gerrymandering. That's just getting your ass kicked.\n\n\nThe senate was never going to stay under dermocratic control, 17% of the country can elect a senate majority, the DNC wins the popular vote nationally in senate races.\n\n\n&gt;&gt; In conclusion, it appears that despite the superior intellect, education, and output the Democrats haven't yet figured out how to win elections so enjoy being ruled by a bunch of dumbass Republicans for the next 4-8 years. Secession isn't likely to work for you, especially since you guys don't like to own guns.\n\nYou know, we'll see, but at some point, people are going to get sick of not having healthcare, social safety nets, a functioning society. The GOP won't be able to spin their failures on the DNC anymore.\n\nThey're an international embarrassment.\n","stickied":false,"gilded":0,"subreddit":"worldnews","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486058685,"link_id":"t3_5nv73m"}{"distinguished":null,"created_utc":1484450695,"id":"dcfyif6","edited":false,"parent_id":"t1_dcfyg2x","author":"pizzashill","score":1,"stickied":false,"gilded":0,"body":"Do you just have a serious reading problem?\n\nThe DNC base is smarter than the GOP base, factually.\n\nThe people running the GOP are not less intelligent than the people running the DNC. The GOP elites are on par with the DNC elites. Not sure what's hard about this to understand.","subreddit":"worldnews","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486058935,"link_id":"t3_5nv73m"}{"link_id":"t3_5nv73m","subreddit_id":"t5_2qh13","retrieved_on":1486059248,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit":"worldnews","stickied":false,"gilded":0,"body":"Here's a yes or no question.\n\nAccording to data, are democrats more educated than republicans?","score":1,"author":"pizzashill","parent_id":"t1_dcfz1hg","id":"dcfz54y","edited":false,"created_utc":1484451548,"distinguished":null}{"score":23,"author":"pizzashill","subreddit":"news","stickied":false,"gilded":0,"body":"Yeah, most people you see making comments like this are American conservatives that don't actually know anything about the world or how it works, but they've been fed a steady diet of propaganda for the last 25 years.\n\nFor example, they'd rather pay twice as much and have an inferior healthcare if it means \"the browns\" aren't getting it for free.","retrieved_on":1486063538,"subreddit_id":"t5_2qh3l","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5o022a","created_utc":1484466585,"distinguished":null,"parent_id":"t1_dcg7l19","edited":false,"id":"dcg7pae"}{"parent_id":"t1_dci5au7","id":"dcig3pm","edited":false,"created_utc":1484600340,"distinguished":null,"subreddit_id":"t5_2uuwv","retrieved_on":1486103930,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5obfcw","score":1,"author":"pizzashill","subreddit":"SRSsucks","stickied":false,"gilded":0,"body":"I got banned from one of those subs for \"ableism\" because I called someone an idiot or something."}{"subreddit":"worldnews","body":"We have a study on this.\n\nhttp://www.forbes.com/sites/timworstall/2016/06/01/us-steel-tariffs-against-china-are-working-americans-losing-jobs-becoming-poorer-as-a-result/","stickied":false,"gilded":0,"score":-1,"author":"pizzashill","link_id":"t3_5ohj48","retrieved_on":1486146478,"subreddit_id":"t5_2qh13","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"distinguished":null,"created_utc":1484731098,"id":"dcktsq2","edited":false,"parent_id":"t1_dcklnqg"}{"created_utc":1484803282,"distinguished":null,"parent_id":"t1_dcll11e","edited":1484803855,"id":"dcm8rej","author":"pizzashill","score":4,"stickied":false,"gilded":0,"body":"Trump is a prime example of the dunning-kruger effect and he displayed that like 200+ times during the election.\n\nHe literally attacked the military for not carrying out a \"surprise attack\" on a large city.\n\nThe guy is a moron of the absolute highest caliber possible.\n\nI can't even fathom how anyone could possibly think Clinton is anywhere near as bad as he is on literally any issue.\n\n","subreddit":"AskReddit","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486172056,"subreddit_id":"t5_2qh1i","link_id":"t3_5orie3"}{"score":7,"author":"pizzashill","subreddit":"CringeAnarchy","stickied":false,"body":"You left out the part where men are more likely to get death threats and threats of physical violence, bud.","gilded":0,"subreddit_id":"t5_35j1r","retrieved_on":1486172947,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5oqbua","created_utc":1484806365,"distinguished":null,"parent_id":"t1_dcm51ax","id":"dcmaidz","edited":false}{"parent_id":"t1_dcmamb5","id":"dcmatwi","edited":false,"created_utc":1484806975,"distinguished":null,"link_id":"t3_5oqbua","subreddit_id":"t5_35j1r","retrieved_on":1486173109,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"CringeAnarchy","body":"I guess it is hard, isn't it?\n\nhttp://www.pewinternet.org/2014/10/22/online-harassment/\n\n&gt;&gt; **Overall, men are somewhat more likely than women to experience at least one of the elements of online harassment, 44% vs. 37%. In terms of specific experiences, men are more likely than women to encounter name-calling, embarrassment, and physical threats.**\n\nDeath threats are under \"physical\" threats.\n","stickied":false,"gilded":0,"score":3,"author":"pizzashill"}{"author":"pizzashill","score":5,"body":"Death threats are under physical threats you mouth-breathing mongoloid.","stickied":false,"gilded":0,"subreddit":"CringeAnarchy","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_35j1r","retrieved_on":1486173143,"link_id":"t3_5oqbua","created_utc":1484807106,"distinguished":null,"parent_id":"t1_dcmavun","id":"dcmawbf","edited":false}{"link_id":"t3_5oqbua","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_35j1r","retrieved_on":1486173285,"body":"I'm convinced you have a literal learning disability, go look at the fucking methods of that poll.\n\nWhen I said \"physical violence and death threats\" I grouping them together.\n\nLike you seem to just be straight up retarded.\n\nYou tried to leave physical threats out because you know it shits on your narrative.\n\nDo the world a favor, go buy yourself a gun, and then blow your brains out before you can breed and spread whatever disability you have.\n","stickied":false,"gilded":0,"subreddit":"CringeAnarchy","author":"pizzashill","score":3,"parent_id":"t1_dcmb3if","edited":false,"id":"dcmb6kt","created_utc":1484807682,"distinguished":null}{"distinguished":null,"created_utc":1484807958,"id":"dcmbbhe","edited":false,"parent_id":"t1_dcmba6b","author":"pizzashill","score":1,"body":"https://www.demos.co.uk/press-release/demos-male-celebrities-receive-more-abuse-on-twitter-than-women-2/\n\nHere's one more for you, but we're done here, you literally don't have the mental capacity to comprehend what's being said to you.\n\nPlease, never breed. ","stickied":false,"gilded":0,"subreddit":"CringeAnarchy","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_35j1r","retrieved_on":1486173353,"link_id":"t3_5oqbua"}{"stickied":false,"gilded":0,"body":"Ok, I can prove pew was including death threats in their physical threats number.\n\nhttp://www.pewinternet.org/2014/10/22/part-5-witnessing-harassment-online/\n\nPage 5:\n\n&gt;&gt; **Physical threats and stalking were observed by some.**\n\n&gt;&gt; **“I have seen people in a group I was in get a death threat before. There is always that one crazy ‘hiding’ behind their computer!”**\n\n\nGG moron, take a seat you disabled clown. Good mental gymnastics attempt though.","subreddit":"CringeAnarchy","author":"pizzashill","score":1,"link_id":"t3_5oqbua","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_35j1r","retrieved_on":1486173453,"distinguished":null,"created_utc":1484808386,"edited":false,"id":"dcmbis9","parent_id":"t1_dcmbgnk"}{"distinguished":null,"created_utc":1484808947,"edited":false,"id":"dcmbs4l","parent_id":"t1_dcmbosc","author":"pizzashill","score":2,"stickied":false,"body":"&gt;&gt; LOL that's actually under the \"stalking\" headline, if you took the time to read. Stalking, in fact, is 3x as likely to be done to women online as it is to men. It's ok, you tried!\n\nNo, it's not under stalking, you can keep trying to lie though.\n\n\nWhat I linked you said physical  threats **and** stalking.  He saw both, that isn't the same thing.\n\nThis will now be my last reply, I'm content that I absolutely destroyed you here, that's evident by the fact you tried to claim physical threats were combined with stalking, that's either you having horrible reading comp, or you knowing you're wrong.\n\nWe'll let the crowd decide, take a seat, moron.","gilded":0,"subreddit":"CringeAnarchy","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_35j1r","retrieved_on":1486173585,"link_id":"t3_5oqbua"}{"subreddit":"worldnews","stickied":false,"gilded":0,"body":"By evidence, do you mean, like, having a show on RT?\n\nhttps://en.wikipedia.org/wiki/World_Tomorrow\n\nHow about the time he tried to deflect away from the Panama leaks?\n\nhttp://dailycaller.com/2016/04/06/wikileaks-goes-full-kremlin-accuses-us-and-soros-of-funding-putin-panama-papers-leak/\n\n&gt;&gt; **“US [government] funded [Panama Papers] attack story on Putin via USAID. Some good journalists but no model for integrity,”**\n\n","score":12,"author":"pizzashill","link_id":"t3_5ou67p","subreddit_id":"t5_2qh13","retrieved_on":1486173821,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"created_utc":1484809993,"distinguished":null,"parent_id":"t1_dcmbyzx","id":"dcmc8se","edited":false}{"link_id":"t3_5osl8y","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2rd2l","retrieved_on":1486201409,"body":"Literally always been that way. They're the most gullible people on the planet, they're really stupid but greatly overestimate their own intelligence so it leads to them thinking they know some secret truths nobody else does.\n","stickied":false,"gilded":0,"subreddit":"Drama","author":"pizzashill","score":1,"parent_id":"t1_dcmb2nm","id":"dcnu8f9","edited":false,"created_utc":1484891127,"distinguished":null}{"id":"dcnwz1n","edited":false,"parent_id":"t1_dcnt64r","distinguished":null,"created_utc":1484896766,"link_id":"t3_5p0x31","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486202794,"stickied":false,"body":"The f-35 is superior to our current fleet.","gilded":0,"subreddit":"news","author":"pizzashill","score":6}{"subreddit_id":"t5_2qh13","retrieved_on":1486204878,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5p2mqu","score":5,"author":"pizzashill","subreddit":"worldnews","stickied":false,"gilded":0,"body":"You'd be wrong, because it is very hard.\n\nIt isn't easy to hit a moving target like that.","parent_id":"t1_dco0lwv","id":"dco11tw","edited":false,"created_utc":1484908279,"distinguished":null}{"created_utc":1484915715,"distinguished":null,"parent_id":"t1_dco2gml","id":"dco3r2r","edited":1484915933,"score":14,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"It's bullshit, anyone that knows their hookers knows Thailand is by far the best.\n\nYou learn how to spot ladyboys and you're set, I'd take a night in Thailand over a week in Russia.\n\nProbably not a good idea to drink though, makes it harder to spot the ladyboys.","retrieved_on":1486206238,"subreddit_id":"t5_2qh3l","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5p32a1"}{"score":342,"author":"pizzashill","subreddit":"pics","stickied":false,"gilded":2,"body":"I can not stress enough how misinformed this comment is.\n\nWhere do we even start?\n\n&gt;&gt; but the current trade deals make it so uncompetitive to manufacture in the US that virtually no apparel makers make stuff here.\n\nWhat? http://www.marketwatch.com/story/us-flips-the-script-on-jobs-reshoring-finally-outpaced-offshoring-in-2014-2015-05-01\n\n&gt;&gt; **CEO Jeff Immelt of GE has said the U.S., on a relative basis, has never been more competitive. For instance, he’s said it takes three hours or less to make a refrigerator, so the total cost can be lower to have it made domestically versus in China or Mexico when factoring in other costs including transportation.**\n\n&gt;&gt; In fact, among the world’s top 10 export economies, the U.S. last year ranked No. 2 — behind only China — for cost competitiveness, according to the Boston Consulting Group, with real estate and natural gas and other energy prices tending to apply downward cost pressure in the U.S.\n\n\nSo where did you hear this at?\n\n\n&gt;&gt; Anybody who does puts themselves at a massive production cost disadvantage.\n\nYou understand the US is a consumer based economy, right? We want **cheap** production, that's amazing for us. \n\nhttp://bernard.pitzer.edu/~lyamane/poptrade.html\n\n&gt;&gt; **\"Competing in the world marketplace\": One of the most popular, enduring misconceptions of practical men is that countries are in competition with each other in the same way that companies in the same business are in competition. Ricardo already knew better in 1817. An introductory economics course should drive home to students the point that international trade is not about competition, it is about mutually beneficial exchange. Even more fundamentally, we should be able to teach students that imports, not exports, are the purpose of trade. That is, what a country gains from trade is the ability to import things it wants. Exports are not an objective in and of themselves: the need to export is a burden that a country must bear because its import suppliers are crass enough to demand payment.**\n\n\n\nNot only that, we would probably end up **losing jobs** with the things Trump says.\n\n\nThe steel tariff fiasco is a good example of this.\n\n&gt;&gt; As a result of a Section 201 (“safeguard”) investigation brought at the\nbehest of the U.S. steel industry, President Bush in March 2002 imposed tariffs\non imports of certain steel products for three years and one day. The tariffs,\ncombined with other challenges present in the marketplace at the time and in the\nmonths that followed, boosted steel costs to the detriment of American\ncompanies that use steel to produce goods in the United States. The resulting\nnegative impact included job losses for thousands of American workers.\nThe Consuming Industries Trade Action Coalition (CITAC) Foundation\nrequested a formal examination of the impact of higher steel costs on American\nsteel-consuming industries,1 and in particular, a quantification of employment\nlosses at those companies. This study employed straight-forward and widelyaccepted\nregression analysis using a variety of price and employment data to\nmaximize the reliability of the results.2 We found that:\n• 200,000 Americans lost their jobs to higher steel prices during 2002.\nThese lost jobs represent approximately $4 billion in lost wages from\nFebruary to November 2002.3\n• One out of four (50,000) of these job losses occurred in the metal\nmanufacturing, machinery and equipment and transportation equipment and\nparts sectors.\n• Job losses escalated steadily over 2002, peaking in November (at 202,000\njobs), and slightly declining to 197,000 jobs in December.4\n• More American workers lost their jobs in 2002 to higher steel prices than\nthe total number employed by the U.S. steel industry itself (187,500\nAmericans were employed by U.S. steel producers in December 2002).\n\nSo yeah.\n\n\n\n&gt;&gt; Trump has a point with this. Our trade deals do need to be changed to incentivize US production.\n\nNo he doesn't, and no we don't. Manufacturing has increased here, it hasn't gone down, the jobs just don't exist anymore.\n\nhttps://www.audiotech.com/trends-magazine/images/articles/2015/12/p36-1.png\n\nhttps://plot.ly/~victortchen/417/manufacturing-employment-as-a-percentage-of-nonfarm-employment.png\n\nHere are 2 graphs showing this.\n\nAnd even more:\n\nhttps://www.aeaweb.org/articles?id=10.1257/jep.15.1.125\n\n&gt;&gt; **We describe the main economic arguments posed for and against the North American Free Trade Agreement (NAFTA) during the U.S. policy debate. To evaluate these arguments, we analyze recent trade data and survey post-NAFTA studies. We find that both the U.S. and Mexico benefit from NAFTA, with much larger relative benefits for Mexico. NAFTA also has had little effect on the U.S. labor market. These results confirm the consensus opinion of economists at the time of the debate. Finally, studies find that trade creation greatly exceeds trade diversion in the region under NAFTA, especially in intermediate goods.**\n\n\nAnd even more:\n\nhttp://bigstory.ap.org/article/265cd8fb02fb44a69cf0eaa2063e11d9/mexico-taking-us-factory-jobs-blame-robots-instead\n\n&gt;&gt; But research shows that the automation of U.S. factories is a much bigger factor than foreign trade in the loss of factory jobs. A study at Ball State University's Center for Business and Economic Research last year found that trade accounted for just 13 percent of America's lost factory jobs. The vast majority of the lost jobs — 88 percent — were taken by robots and other homegrown factors that reduce factories' need for human labor.\n\n&gt;&gt; \"We're making more with fewer people,\" says Howard Shatz, a senior economist at the Rand Corp. think tank.\nGeneral Motors, for instance, now employs barely a third of the 600,000 workers it had in the 1970s. Yet it churns out more cars and trucks than ever.\n\n&gt;&gt; In a survey by the consulting firm Deloitte, global manufacturing executives predicted that that the United States — now No. 2 — will overtake China as the most competitive country in manufacturing by 2020. (Competitiveness is measured by such factors as costs, productivity and the protection of intellectual property.)\n\n&gt;&gt; The Reshoring Initiative, a nonprofit that lobbies manufacturers to return jobs to the United States, says America was losing an average of 220,000 net jobs a year to other countries a decade ago. Now, the number being moved abroad is roughly offset by the number that are coming back or being created by foreign investment.","subreddit_id":"t5_2qh0u","retrieved_on":1486229417,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5p7uq9","distinguished":null,"created_utc":1484975945,"edited":1485071505,"id":"dcpd1st","parent_id":"t1_dcpbebf"}{"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486230041,"link_id":"t3_5p7uq9","author":"pizzashill","score":13,"body":"The OP might have been about this, but that person's comment was not about this.\n\n\nOn top of that, you should have read my links.\n\nhttp://www.marketwatch.com/story/us-flips-the-script-on-jobs-reshoring-finally-outpaced-offshoring-in-2014-2015-05-01\n\n&gt;&gt; **And it’s not just hard goods. Fashion is also a key reshoring industry. Brooks Brothers, which also has a website section touting U.S.-made clothing and accessories, has told MarketWatch it’s increased the percentage of its merchandise that is domestically sourced.**\n","stickied":false,"gilded":0,"subreddit":"pics","parent_id":"t1_dcpe7ju","edited":false,"id":"dcpe9pf","created_utc":1484978227,"distinguished":null}{"stickied":false,"body":"Automation has killed the vast majority of manufacturing jobs.\n\nA factory that required 800 people in the 60s might require 50 now.","gilded":0,"subreddit":"pics","author":"pizzashill","score":16,"link_id":"t3_5p7uq9","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh0u","retrieved_on":1486230052,"distinguished":null,"created_utc":1484978268,"edited":false,"id":"dcpeagz","parent_id":"t1_dcpe9rw"}{"subreddit_id":"t5_2qh0u","retrieved_on":1486230312,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5p7uq9","score":19,"author":"pizzashill","subreddit":"pics","stickied":false,"gilded":0,"body":"Except, the reshoring is happening for cheap items too, did you clink on a single thing I linked?\n\n&gt;&gt; **“Our model suggests the U.S. can offer very competitive manufacturing options, especially given many rising cost variables overseas,” according to a Wal-Mart statement on the initiative. The company pointed to 500 “active initiatives” involving product categories as diverse as tires, bicycles, home textiles, toys and cookware.**\n\n\nI'm baffled you do this for a living, because you seem to just have no idea what you're talking about really.\n\nLike I said, the goal of trade is not exports, it is imports. \n\nEdit: I think he replied to the wrong person, I didn't read his comment correctly the first time.","edited":1484986103,"id":"dcpesgo","parent_id":"t1_dcpeopm","distinguished":null,"created_utc":1484979289}{"parent_id":"t1_dcpexbs","id":"dcpf21z","edited":false,"created_utc":1484979843,"distinguished":null,"link_id":"t3_5p7uq9","subreddit_id":"t5_2qh0u","retrieved_on":1486230451,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"pics","stickied":false,"body":"You guys seem to think we live in a 3rd world export economy.\n\n&gt;&gt; There is a vast world of difference between exporting a $200M Boeing 787 and exporting $200M worth of $20 gadgets spread across 150 manufacturing firms.\n\nA) The sources I provided clearly show that low end products are coming back too. http://www.marketwatch.com/story/us-flips-the-script-on-jobs-reshoring-finally-outpaced-offshoring-in-2014-2015-05-01\n\n&gt;&gt; “Our model suggests the U.S. can offer very competitive manufacturing options, especially given many rising cost variables overseas,” according to a Wal-Mart statement on the initiative. The company pointed to 500 “active initiatives” involving product categories as diverse as tires, bicycles, home textiles, toys and cookware.\n\nB) why on earth would you want to export low end products? Have you ever heard of comparative advantage?\n\nhttps://en.wikipedia.org/wiki/Comparative_advantage\n\n\n&gt;&gt; Guess which one employs an order of magnitude more people and is far more meaningful to the working man on the street? Who gives a fuck about some meaningless GDP number when everyone around you is doing worse off than before?\n\nExcept everyone around us is **not** doing worse off than before. You can argue that some people were hurt, but there were more winners than losers.\n\nhttp://www.nber.org/papers/w18508\n\n&gt;&gt; We build into a Ricardian model sectoral linkages, trade in intermediate goods, and sectoral heterogeneity in production to quantify the trade and welfare effects from tariff changes. We also propose a new method to estimate sectoral trade elasticities consistent with any trade model that delivers a multiplicative gravity equation. We apply our model and use our estimated elasticities to identify the impact of NAFTA's tariff reductions. We find that Mexico's welfare increases by 1.31%, U.S.'s welfare increases by 0.08%, and Canada's welfare declines by 0.06%. We find that intra-bloc trade increases by 118% for Mexico, 11% for Canada and 41% for the U.S. We show that welfare effects from tariff reductions are reduced when the structure of production does not take into account intermediate goods or input-output linkages. Our results highlight the importance of sectoral heterogeneity, intermediate goods and sectoral linkages for the quantification of the welfare gains from tariffs reductions.\n\nOk.\n\n\n\n&gt;&gt; You can spit on people and tell them it's raining all you want - just don't be surprised when a significant number of them call you on your bullshit.\n\nI mean, you just displayed you have no clue what you're talking about on even a basic level.\n\nLet me copy paste this one more time:\n\n\n&gt;&gt; **\"Competing in the world marketplace\": One of the most popular, enduring misconceptions of practical men is that countries are in competition with each other in the same way that companies in the same business are in competition. Ricardo already knew better in 1817. An introductory economics course should drive home to students the point that international trade is not about competition, it is about mutually beneficial exchange. Even more fundamentally, we should be able to teach students that imports, not exports, are the purpose of trade. That is, what a country gains from trade is the ability to import things it wants. Exports are not an objective in and of themselves: the need to export is a burden that a country must bear because its import suppliers are crass enough to demand payment.**\n\n\n**automation killed the vast majority of these jobs.**\n\nhttp://bigstory.ap.org/article/265cd8fb02fb44a69cf0eaa2063e11d9/mexico-taking-us-factory-jobs-blame-robots-instead\n\n&gt;&gt; **But research shows that the automation of U.S. factories is a much bigger factor than foreign trade in the loss of factory jobs. A study at Ball State University's Center for Business and Economic Research last year found that trade accounted for just 13 percent of America's lost factory jobs. The vast majority of the lost jobs — 88 percent — were taken by robots and other homegrown factors that reduce factories' need for human labor.**\n\n","gilded":0,"score":11,"author":"pizzashill"}{"link_id":"t3_5p7uq9","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh0u","retrieved_on":1486230679,"stickied":false,"body":"He was blatantly wrong about nearly everything he said. What else do you want me to say?\n\nHe tried to claim he did this for a living, yet clearly doesn't understand the subject, then tried to claim I didn't understand it.","gilded":0,"subreddit":"pics","author":"pizzashill","score":21,"edited":false,"id":"dcpfi7c","parent_id":"t1_dcpfhg6","distinguished":null,"created_utc":1484980812}{"score":23,"author":"pizzashill","subreddit":"pics","gilded":0,"stickied":false,"body":"What did I link that was \"biased\" towards my point?\n\nExplain in detail how anything I linked was \"biased.\"\n","subreddit_id":"t5_2qh0u","retrieved_on":1486230803,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5p7uq9","created_utc":1484981327,"distinguished":null,"parent_id":"t1_dcpfpkg","edited":1484981513,"id":"dcpfqpe"}{"author":"pizzashill","score":13,"gilded":0,"stickied":false,"body":"You mean my multiple studies, from credible economic journals?\n\nIs the field of economics biased against you now? \n\nCan you point out what was factually incorrect in anything I linked?","subreddit":"pics","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486230887,"link_id":"t3_5p7uq9","distinguished":null,"created_utc":1484981685,"edited":false,"id":"dcpfwgs","parent_id":"t1_dcpfuym"}{"subreddit":"pics","stickied":false,"body":"https://en.wikipedia.org/wiki/Comparative_advantage\n\nAgain, for the 4th time in this argument.\n\n\n\n&gt;&gt; \"Competing in the world marketplace\": One of the most popular, enduring misconceptions of practical men is that countries are in competition with each other in the same way that companies in the same business are in competition. Ricardo already knew better in 1817. An introductory economics course should drive home to students the point that international trade is not about competition, it is about mutually beneficial exchange. Even more fundamentally, we should be able to teach students that imports, not exports, are the purpose of trade. That is, what a country gains from trade is the ability to import things it wants. Exports are not an objective in and of themselves: the need to export is a burden that a country must bear because its import suppliers are crass enough to demand payment.\n\n\nYou guys are going to have to accept the fact that this is not a 3rd world export economy, as for the rest of your comment:\n\nhttp://www.marketwatch.com/story/us-flips-the-script-on-jobs-reshoring-finally-outpaced-offshoring-in-2014-2015-05-01\n\n&gt;&gt; **“Our model suggests the U.S. can offer very competitive manufacturing options, especially given many rising cost variables overseas,” according to a Wal-Mart statement on the initiative. The company pointed to 500 “active initiatives” involving product categories as diverse as tires, bicycles, home textiles, toys and cookware.**\n\n\nhttp://bigstory.ap.org/article/265cd8fb02fb44a69cf0eaa2063e11d9/mexico-taking-us-factory-jobs-blame-robots-instead\n\n&gt;&gt; **But research shows that the automation of U.S. factories is a much bigger factor than foreign trade in the loss of factory jobs. A study at Ball State University's Center for Business and Economic Research last year found that trade accounted for just 13 percent of America's lost factory jobs. The vast majority of the lost jobs — 88 percent — were taken by robots and other homegrown factors that reduce factories' need for human labor.**\n\n","gilded":0,"score":2,"author":"pizzashill","link_id":"t3_5p7uq9","subreddit_id":"t5_2qh0u","retrieved_on":1486231388,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"distinguished":null,"created_utc":1484984066,"edited":1484985717,"id":"dcpgwdp","parent_id":"t1_dcpgup8"}{"link_id":"t3_5p7uq9","subreddit_id":"t5_2qh0u","retrieved_on":1486231513,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit":"pics","gilded":0,"stickied":false,"body":"A lot of this stuff is kind of counter intuitive. People really do think we're competing with other countries like a corporation or something, they don't understand why protectionism is bad for everyone.\n\nThey're just basing their views on emotion rather than fact. \n\nFor example, I see Trump supporters say Trump is going to negotiate NAFTA, yet when I ask them to point out what isn't fair about NAFTA they can never come up with an answer.\n\nThe only reply I've got is \"Trump tweets about it all of the time!\"","score":6,"author":"pizzashill","id":"dcph5b1","edited":false,"parent_id":"t1_dcpgk16","distinguished":null,"created_utc":1484984678}{"edited":false,"id":"dcphkee","parent_id":"t1_dcphfvs","distinguished":null,"created_utc":1484985765,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486231731,"link_id":"t3_5p7uq9","author":"pizzashill","score":4,"gilded":0,"stickied":false,"body":"http://bigstory.ap.org/article/265cd8fb02fb44a69cf0eaa2063e11d9/mexico-taking-us-factory-jobs-blame-robots-instead\n\n&gt;&gt; But research shows that the automation of U.S. factories is a much bigger factor than foreign trade in the loss of factory jobs. A study at Ball State University's Center for Business and Economic Research last year found that trade accounted for just 13 percent of America's lost factory jobs. The vast majority of the lost jobs — 88 percent — were taken by robots and other homegrown factors that reduce factories' need for human labor.\n\n1\n\n&gt;&gt; \"Competing in the world marketplace\": One of the most popular, enduring misconceptions of practical men is that countries are in competition with each other in the same way that companies in the same business are in competition. Ricardo already knew better in 1817. An introductory economics course should drive home to students the point that international trade is not about competition, it is about mutually beneficial exchange. Even more fundamentally, we should be able to teach students that imports, not exports, are the purpose of trade. That is, what a country gains from trade is the ability to import things it wants. Exports are not an objective in and of themselves: the need to export is a burden that a country must bear because its import suppliers are crass enough to demand payment.\n\n2","subreddit":"pics"}{"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486231794,"link_id":"t3_5p7uq9","author":"pizzashill","score":8,"stickied":false,"body":"Yeah I thought so too, but it seemed like he was talking to me at the end.\n\nBut now that I read it a second time, I think I might have just replied too fast.","gilded":0,"subreddit":"pics","parent_id":"t1_dcphmkq","id":"dcphono","edited":false,"created_utc":1484986086,"distinguished":null}{"parent_id":"t1_dcphym2","edited":1484988111,"id":"dcpi5el","created_utc":1484987374,"distinguished":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486232033,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5p7uq9","score":2,"author":"pizzashill","subreddit":"pics","body":"&gt;&gt; Did you reply to the wrong person? I pointed out your numbers were garbage. Those quotes do not refute that--in fact many of them are taken out of context. Take your last quote for example.\n\nNo, your argument is just hilariously awful. You seem to not know what comparative advantage is, you seem to think the US should be a 3rd world export economy.\n\nYou're trying to claim the US doesn't build stuff, when we clearly do. What you mean is the US doesn't really build low end garbage, because we have no reason to.\n\n&gt;&gt; It comes from this report. First, your figures used growth since the 50's, but that quote? Is strictly from the last decade. Why is that important? Well its because of what I said in my post....\n\nWhat I linked wasn't related to output, it was related to the loss of manufacturing jobs.\n\nThe US is still building a lot of stuff though, this is called a modern economy, we don't need to produce t-shirts or shoes here anymore.\n\nYou seem to think we should be exporting shoes and t-shirts over high end stuff, which is just weird.\n\n&gt;&gt; Which means value of 'real manufacturing dollars' has jumped (Which given how we measure production? Means productivity in this field skyrockets.) But it doesn't make new jobs, because a lot of the 'productivity' is actually just poor tracking of value due to Moore's law dramatically increasing the efficiency of the components.\n\nAt no point did I say it causes more jobs, I pointed out the US, in terms of real value, produces more with less people working.\n\nAnd this applies to pretty much everything we build.\n\n&gt;&gt; You really need to dig into your sources--because your source doesn't refute what I was pointing out at all, in fact it ironically supports how people are pushing agendas by choosing dubious start and stop points for data collection in order to overemphasize the difficulties in track electronic value/inflation.\n\nYou seem to just have really poor reading comp, actually. \n\nhttps://en.wikipedia.org/wiki/List_of_exports_of_the_United_States\n\nThe US is exporting and building a lot of stuff, I'm not really sure what argument you're trying to make here, my argument is the jobs are never coming back, and they just aren't.\n\nHere's yet another list of US exports.\n\nhttp://www.worldsrichestcountries.com/top_us_exports.html\n\n","stickied":false,"gilded":0}{"parent_id":"t1_dcpi8wi","id":"dcpi9xg","edited":false,"created_utc":1484987726,"distinguished":null,"link_id":"t3_5p7uq9","subreddit_id":"t5_2qh0u","retrieved_on":1486232098,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit":"pics","body":"What's my point? That nothing you said would do what you think it does.\n\nThey're automating these jobs in China.\n\nhttps://www.ft.com/content/1dbd8c60-0cc6-11e6-ad80-67655613c2d6\n\nWe could deregulate and lower taxes all day, if they're automating jobs in China, what on earth makes you think those jobs are ever coming back?","stickied":false,"gilded":0,"score":8,"author":"pizzashill"}{"link_id":"t3_5p7uq9","subreddit_id":"t5_2qh0u","retrieved_on":1486232135,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"pics","stickied":false,"gilded":0,"body":"The US is already competitive, you were given a link for this.\n\nhttp://www.marketwatch.com/story/us-flips-the-script-on-jobs-reshoring-finally-outpaced-offshoring-in-2014-2015-05-01\n\n&gt;&gt; “Our model suggests the U.S. can offer very competitive manufacturing options, especially given many rising cost variables overseas,” according to a Wal-Mart statement on the initiative. The company pointed to 500 “active initiatives” involving product categories as diverse as tires, bicycles, home textiles, toys and cookware.\n\n1\n\n&gt;&gt; CEO Jeff Immelt of GE has said the U.S., on a relative basis, has never been more competitive. For instance, he’s said it takes three hours or less to make a refrigerator, so the total cost can be lower to have it made domestically versus in China or Mexico when factoring in other costs including transportation.\n\n&gt;&gt; In fact, among the world’s top 10 export economies, the U.S. last year ranked No. 2 — behind only China — for cost competitiveness, according to the Boston Consulting Group, with real estate and natural gas and other energy prices tending to apply downward cost pressure in the U.S.\n\n2\n\n\n\n\n&gt;&gt; Have you ever tried to start a business? Have you ever paid taxes?! If so, how much do you pay?\n\nUh, not really sure what this has to do with you not understanding economics and being misinformed.\n\nYou basically just admitted you can't argue the facts, so you're going to try to sling ad hominems.\n","score":6,"author":"pizzashill","edited":false,"id":"dcpicib","parent_id":"t1_dcpiav5","distinguished":null,"created_utc":1484987935}{"link_id":"t3_5p7uq9","retrieved_on":1486232303,"subreddit_id":"t5_2qh0u","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"pics","stickied":false,"body":"&gt;&gt; China #4, US #8. Starting a business 3 vs 51! It is hard to compete in the US when you don't have capital like Walmart.. it's hard for the little guy. It's hard to disrupt huge companies because our gov't is way too powerful/overreaching in general.\n\nLast I checked, this is a discussion on manufacturing, not business. \n\nNot only that, the corporate tax rates here are lower than they've ever been.\n\n&gt;&gt; Well yeah, of course it's relevant if you've never ran a business! It's difficult to hire people here, it's risky. Ever paid payroll tax? Ever had to hire accounts, HR, etc. cruft getting in the way of running your business/pleasing customers?!\nIt's ass backwards we give up almost 40% of our productivity to gov't! How much better off would you be if you went from paying 30% taxes to 15%? If you make $60k/yr that's saving $9k. That's a boat. You could buy a boat.\n\nThis, to me, seems like a \"wahh I don't want to pay taxes.\"\n\nYou can't just slash everyone's taxes, this is a serious misunderstanding of how the world works.\n\nLet's say we slash those taxes.\n\nHow do we pay for the military?\n\nThe roads?\n\nThe schools?\n\nSocial safety nets?\n\nThe police?\n\nDo you think all of those things are free?\n\nI also suggest you learn what an \"effective\" tax rate is.","gilded":0,"score":5,"author":"pizzashill","parent_id":"t1_dcpim4o","edited":false,"id":"dcpiojj","created_utc":1484988906,"distinguished":null}{"link_id":"t3_5p7uq9","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh0u","retrieved_on":1486232378,"stickied":false,"body":"&gt;&gt; You don't know what third world means. I never claimed the U.S. doesn't build stuff, either. Anywhere. Show me where I claimed that.\n\nYou replied to me and tried to claim US manufacturing output wasn't actually up, we're just building more expensive things.\n\nThat is a god awful argument.\n\n\n&gt;&gt; Your links are ALL related to output. How they derive their numbers is is derived from \"real manufacturing outpout\". Which is derived in dollars of product produced. But this has fundamental difficulties in tracking inflation vs quality of product. Which is why things get difficult when tracking electronics. Electronics track with inflation differently because the growth in chips and circuitry is often exponential thanks to Moore's law--this means the actual dollars economists estimate is produced is greatly inflated, even though sales of real product when tracked to general inflation is not. This is how it APPEARS that manufacturing jobs are lost to a greater degree than they are through increased production (IE automation) because productivity is skyrocketing but no new jobs are being created to account for that increase (But as I showed you in the linked paper which your quotes are based off of? The formula used doesn't account for the quirk in the electronics field and why electronics grows more rapidly based on outpout than it actually, physically does. Listen, I can't give you a semester of economics in a post--but read over the paper linked.)\n\n\nListen, the objective fact is the US manufacturing output has done nothing but increase in terms of value, you can sit here and try to mental gymnastics this all day long, you're wrong.\n\nYour argument makes no logical sense.\n\n&gt;&gt; I said it doesn't cause more jobs, because when they do the 'jobs lost' numbers, what they do is compare productivity (IE increased real dollars produced) vs many other metrics, like trade (The formulas are in the paper) and total jobs in field. That's how they figure out which % of jobs is lost where. This number is skewed though because the inflation value of electronics is grossly misinterpreted due to the nature of electronics.\n\n\nYou seem to have some weird obsession with \"electronics.\" \n\nLook, you're entitled to your opinion, I'll stick with the economic consensus that automation killed the vast majority of low end manufacturing jobs.\n\n\n&gt;&gt; My argument is that economics is relative. Obtusely linking manufacturing dollars with no context how they are derived or the total GDP they exist relative too? Is silly. As is linking exports without accounting for imports or total GDP ect. Yes, we export a lot. We still have a deficit of 40 billion PER MONTH, relative to our Economy we do not make a lot, but relative to OTHER economies, because of our size, we do. The issue is, if we had better trade deals, we could actually make A LOT MORE.\n\nLiterally delusional. And I'll call you on this right now.\n\nPoint out what isn't fair about NAFTA, how could NAFTA be made better?\n\nAlso, deficits don't really matter.\n\nhttps://philadelphiafed.org/research-and-data/publications/business-review/2007/q1/br_q1-2007-1_trade-deficit.pdf\n\n\n&gt;&gt; Yeah, think of how silly that sounds. That's effectively how you're arguing right now.\n\nNot really, I'm just basing my views on the economic consensus, you're repeating the same drivel Trump does about how trade deals aren't fair.\n\nhttp://www.igmchicago.org/igm-economic-experts-panel/poll-results?SurveyID=SV_25byqjBle85jqy9\n\nhttp://www.igmchicago.org/igm-economic-experts-panel/poll-results?SurveyID=SV_a3jxYtWKoF4vSKx\n\n","gilded":0,"subreddit":"pics","author":"pizzashill","score":2,"id":"dcpiu2r","edited":1484989708,"parent_id":"t1_dcpiq53","distinguished":null,"created_utc":1484989359}{"stickied":false,"gilded":0,"body":"&gt;&gt; Manufacturing is business...\n\nUh, there's a difference between what you linked and business tax rates.\n\nThe US, as far as manufacturing is concerned, is competitive, #2 in the world actually.\n\n\n&gt;&gt; My taxes, as a small business owner, are insane. I'm sure taxes for other companies are ridiculous as well. You may be forgetting about all of the other costs: HR, payroll tax, etc.\n\nEffective tax rates for large corporations are not very high.\n\n&gt;&gt; ou don't even pay taxes! You don't know how the world works.\n\nYes, I do, you tard. \n\n\n&gt;&gt; You don't know how the world works. The US used to take 10% of our productivity to run the country. Now it takes 40%\n\nThis is literally incoherent.\n\n&gt;&gt; Is there no waste in our country!? It is crazy where our money goes.\n\nLmao what?\n\n&gt;&gt; Obviously gov't is good and upholding peoples' rights is a necessity, but you are honestly of the belief that there can't be regulations/taxes that need cutting?\n\nUh, I support lowering corporate tax rates, they're a trivial share of revenue, the problem is slashing corporate tax rates doesn't really lead to job growth.\n\n\n&gt;&gt; Yes, I know what that is.. I pay taxes... you don't.. ?!\n\nHonestly, to me, you sound like an uneducated rural bumpkin that voted Trump and you're trying to gymnastics it in your head.\n","subreddit":"pics","author":"pizzashill","score":6,"link_id":"t3_5p7uq9","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh0u","retrieved_on":1486232423,"distinguished":null,"created_utc":1484989630,"id":"dcpix97","edited":false,"parent_id":"t1_dcpis1b"}{"score":10,"author":"pizzashill","subreddit":"worldnews","stickied":false,"gilded":0,"body":"This is bullshit, lol.\n\nhttp://natoassociation.ca/some-myths-concerning-investor-state-dispute-settlement/\n\n&gt;&gt; In 2014, Charles N. Brower of the Iran-US Claims Tribunal and Sadie Blanchard of Yale Law School published an article in the Columbia Journal of Transnational law outlining various common myths regarding ISDS. They assert that the balance of power created by international arbitration mechanisms is not nearly as asymmetric as its opponents would allege. They found that tribunals under the International Centre for Settlement of Investment Disputes (ICSID) have ruled in favour of investors in 46% of cases and have typically granted less than 40% of the damages initially sought. This does not indicate any form of systemic bias in favour of investors in international arbitration courts.\n\n&gt;&gt; Additionally, governments possess a wide variety of tools to sanction breaches by investors. Aside from civil damages, governments may also seek criminal sanctions in their own courts. Expropriation of assets may also serve as an enforcement tool for wronged governments. Conversely, in developing countries with politicized judicial systems, arbitration tribunals established by trade agreements often serve as investors’ only recourse in recovering damages from governments.\n\n&gt;&gt; Brower and Blanchard deconstruct allegations of ISDS eroding national sovereignty by pointing out that limiting the scope of legitimate state action is precisely the purpose of international treaties. Criticisms of this type made with respect to ISDS may be equally applied to all international conventions that include enforcement mechanisms, without which they are effectively toothless. Concerns regarding the content that is being enforced may be entirely valid. However, the mere presence of an enforcement mechanism should not be viewed as a point against the TPP.\n\n&gt;&gt; The authors of the article also state that ISDS is highly unlikely to interfere with the imposition of environmental regulations that reduce the return on certain investments. Not a single environmental regulation has been struck down via ISDS as of the time of writing, and no damages have been awarded to investors pursuant to a claim regarding the enforcement of an environmental law.\n","subreddit_id":"t5_2qh13","retrieved_on":1486232602,"author_flair_css_class":null,"controversiality":1,"author_flair_text":null,"link_id":"t3_5p9fwi","created_utc":1484990748,"distinguished":null,"parent_id":"t1_dcpizey","id":"dcpjafv","edited":false}{"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486232689,"link_id":"t3_5p7uq9","author":"pizzashill","score":3,"stickied":false,"gilded":0,"body":"&gt;&gt; I never said U.S. manufacturing wasn't up. I said the numbers were misleading. Do you even read? I also said those numbers in the absence of how they are derived and the TOTAL GDP are silly. If U.S. manufacturing grew 4 times the base amount, and total GDP grew 6 times--then its shrunk RELATIVE to the total economy even though its grown in absolute.\n\n\nManufacturing in terms of value was on a steady increase, the increase never changed. So your argument doesn't really make sense.\n\nIt never slowed down. The jobs did, manufacturing didn't. You can keep going back, manufacturing jobs were on a slow decline for years.\n\n&gt;&gt; And? The global economy has done nothing but increase in terms of value. Global GDP has grown by an absorbent amount. As I said above, there are a lot more customers, there is a lot more wealth--but we're producing much less of it. Part of that is because our trade deals hamper our growth.\n\nSee above.\n\nThis also doesn't make sense. The US got a huge advantage after ww2 because of the rest of the world got bombed out, we were something like 50% of world output at one point.\n\nThat was never going to last, clearly, we actually have to compete now. The US is like 25% of the worlds manufacturing output currently and 5% of the world's population.\n\nHow much higher do you think that can possibly go? This has nothing to do with \"bad trade deals\" that's a fabrication.\n\nhttps://www.uschamberfoundation.org/blog/post/manufacturing-s-declining-share-gdp-global-phenomenon-and-it-s-something-celebrate/34261\n\nNot only that, this is happening all over the world.\n\n&gt;&gt; **It’s also interesting to note that the decline in manufacturing’s share of U.S. GDP over the last forty years is nearly identical to the decline in world manufacturing as a share of world GDP, which fell from 26.6% in 1970 to 16.2% in 2010. Therefore, we can conclude that the declining share of manufacturing’s contribution to GDP is not unique to America, but reflects a global trend as the world moves from a traditional manufacturing-intensive “Machine Age” economy to more a services-intensive “Information Age” economy.**\n\nThis obsession with manufacturing is just cringe.\n\n\n\n\n&gt;&gt; How is it delusional to point out GDP and trade deficits? LOL. This is basic economics. Fucking BASIC.\n\nBecause trade deficits don't matter.\n\nhttps://philadelphiafed.org/research-and-data/publications/business-review/2007/q1/br_q1-2007-1_trade-deficit.pdf\n\n\n&gt;&gt; I was discussing China. Again, how fucking bad is your reading comprehension (NAFTA isn't nearly as bad as China because the Mexican government is too weak to do a lot of the subsidizing and currency manipulation China does.)\n\n**TRUMP IS GOING AFTER NAFTA, LOL.** The man is a moron. He won't do shit to China because he's afraid of them.\n\nAs for the Chinese shit, the US is guilty of the same things in other areas.\n\n\n&gt;&gt; Wait...wait...Your basing your opinions off of just economists that specifically belong to Chicago-School neoliberal ideological bends within the IGM group?\n\n\nAnd \"neoliberal\" is thrown out, this discussion is now over. You're clueless.\n\nLiteral buzzword. You don't even understand globalism.\n\nhttps://piie.com/commentary/speeches-papers/globalization-concept-causes-and-consequences\n\nPS: free trade has consensus across every credible school of economics.\n","subreddit":"pics","edited":1484991757,"id":"dcpjglc","parent_id":"t1_dcpja9x","distinguished":null,"created_utc":1484991281}{"distinguished":null,"created_utc":1484991883,"edited":1484992307,"id":"dcpjnba","parent_id":"t1_dcpjm4f","score":2,"author":"pizzashill","subreddit":"pics","body":"&gt;&gt; Oh dear, links a paper that says trade deficits aren't as bad as you think....then says they don't matter.\n\nYou should read the paper.\n\n&gt;&gt; And oooo, saying one of the largest figures in economics that he's basing his argument on is wrong because \"Neo-liberalism\" is a buzz word. Not like extensive papers have been written on it for the last 60 years.\n\nneoliberal literally is a buzzword, you're clueless. At least in the way you tried to use it.\n\n&gt;&gt; Ouch, again, sorry, I thought I was arguing with someone with SOME economic background. I can see now you have none. Perhaps the back of a cereal box? You have a nice day man.\n\nSays the person throwing out far left buzzwords.\n\nhttps://www.uschamberfoundation.org/blog/post/manufacturing-s-declining-share-gdp-global-phenomenon-and-it-s-something-celebrate/34261\n\n&gt;&gt; **It’s also interesting to note that the decline in manufacturing’s share of U.S. GDP over the last forty years is nearly identical to the decline in world manufacturing as a share of world GDP, which fell from 26.6% in 1970 to 16.2% in 2010. Therefore, we can conclude that the declining share of manufacturing’s contribution to GDP is not unique to America, but reflects a global trend as the world moves from a traditional manufacturing-intensive “Machine Age” economy to more a services-intensive “Information Age” economy.**\n\n&gt;&gt; **In that case, even if the U.S. was a closed economy with no competition from foreign manufacturers, it would have been inevitable that manufacturing’s share of national income and employment would have followed exactly the same downward trend that prevailed over the last forty years, as the U.S. economy evolved into a modern service-based economy. When we complain that \"nothing is made here anymore,\" it's not so much that somebody else is manufacturing the goods that used to be made here as it is the case that we (and others around the world) just don't need as much \"stuff\" any more in relation to the overall size of the economy.**\n\n&gt;&gt; **An alternative explanation is that we really are experiencing an inevitable shift to a post-industrial, Information Age economy where manufacturing’s importance to output and jobs is declining, similar to the trend in agriculture over the last century.**\n\n&gt;&gt; **Manufacturing’s declining share of output isn’t a sign of economic weakness—it’s just the opposite. It’s a sign that advances in manufacturing productivity and efficiency are translating into lower prices for consumers when they purchase things like cars, food, clothing, appliances, furniture, and electronic goods. In the U.S., the price of goods relative to services fell by 52 percent between 1970 and 2010, so it’s not surprising that manufacturing’s importance in the economy has fallen significantly.**\n\n&gt;&gt; **As spending on manufactured goods as a share of household income declines, it raises our standard of living, and for that “decline in manufacturing” we should celebrate, not complain.**     \n\n\n\nSorry, you lose. The fact you seem to think the US could have kept 50% of the worlds manufacturing output is just nuts to me.","stickied":false,"gilded":0,"subreddit_id":"t5_2qh0u","retrieved_on":1486232782,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"link_id":"t3_5p7uq9"}{"link_id":"t3_5p7uq9","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486232793,"subreddit_id":"t5_2qh0u","body":"&gt;&gt; Yes, because the money is in the US and the products are produced close to here, not at a great benefit to us here because most profits end up off shore/etc. for tax reasons............................\n\nNo they fucking don't, what??\n\n&gt;&gt; Right, they do everything they can (outsourcing, incorporating in maryland, etc.).\n\nLol..\n\n&gt;&gt; How much do you pay in taxes? Do you run a business?\n\nMore than you, trust me.\n\n&gt;&gt; Nope, just a few years older than you.\n\nYeah, clearly.\n\nhttp://fivethirtyeight.com/features/education-not-income-predicted-who-would-vote-for-trump/\n\n\n\n","stickied":false,"gilded":0,"subreddit":"pics","author":"pizzashill","score":6,"parent_id":"t1_dcpjlst","edited":false,"id":"dcpjo2y","created_utc":1484991951,"distinguished":null}{"id":"dcpjxz1","edited":1484994372,"parent_id":"t1_dcpjvo9","distinguished":null,"created_utc":1484992849,"link_id":"t3_5p7uq9","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486232926,"stickied":false,"body":"&gt;&gt; Ooooh so now relative production counts? LOL but only when it doesn't make your arguments look retarded, right?\n\nUh, I never said it didn't really count, I just misread your first comment. My argument was that manufacturing value was always increasing while the jobs were decreasing.\n\n\n\n&gt;&gt; Yes on that count we could not have hoped to maintain that amount of global production. We could push for much more than we have today. Remember by cereal box example of 1000 dollars and 1400 dollars? No one is saying miracles would happen. But we could have a lot more if we leveraged our position as 1.) A reserve currency 2.) The global hegemony/security apparatus.\n\nThe idea that you seem to think we could increase manufacturing here is weird to me, the US is already pretty competitive in this area.\n\nThere's literally no reason to bring very low end manufacturing back, it'd be automated instantly, that's already happening.\n\nWe literally can't fill the jobs.\n\nhttp://www.wsj.com/articles/as-skill-requirements-increase-more-manufacturing-jobs-go-unfilled-1472733676\n\n&gt;&gt; Also, keep going with that neoliberal is a buzzword kid. Ignoring the fact that Milton Friendman regularly used it, and its used regularly in the field. I literally used it in economics papers in school. Listen, I don't know why I'm responding again. I guess I have a morbid fascination with people who pretend to understand economics. But if you're going to try to wax intellectual about it? Learn the words at least. Okay? Now for real, have a good night, and maybe go read some Hayek and Friedman if you're going to espouse them without knowing it.\n\nUh, I know neoliberal is a real thing, it's used as a buzzword on the internet by people that are anti-free trade, mainly by Berntards.\n\nRand paul would be a \"neoliberal.\"\n\nBut the way you used it, you tried to dismiss an entire field of economics by declaring them \"neoliberals.\"\n\nFree trade has consensus across every credible school.\n\nhttps://np.reddit.com/r/badeconomics/comments/4w00z8/neoliberalism_caused_donald_trump_or_how_i/\n\n\"neoliberal\" being a thing wasn't being contested, the context in which you tried to use it was what made it a buzzword.","gilded":0,"subreddit":"pics","author":"pizzashill","score":3}{"link_id":"t3_5p7uq9","retrieved_on":1486233367,"subreddit_id":"t5_2qh0u","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"pics","body":"There wasn't really any valid argument there, lol.\n\nHe seems to think the US can increase low-end manufacturing. He called an entire field of economics \"neoliberal.\"\n\nHe tried to call me out for not showing manufacturing output compared to GDP growth, which doesn't make sense considering manufacturing as a share of world GDP has been shrinking for years.\n\nThe idea we could go back to being 30-50% of the worlds manufacturing output is just not based on facts.","stickied":false,"gilded":0,"score":3,"author":"pizzashill","parent_id":"t1_dcpkr95","edited":false,"id":"dcpku7a","created_utc":1484995840,"distinguished":null}{"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486233406,"link_id":"t3_5p9fwi","author":"pizzashill","score":-1,"stickied":false,"body":"There are thousands of these, not one environmental regulation has been over turned.\n\nAlso, in order to even get any settlement they have to prove the country literally targeted them unfairly.","gilded":0,"subreddit":"worldnews","edited":false,"id":"dcpkx1z","parent_id":"t1_dcpkw01","distinguished":null,"created_utc":1484996111}{"score":3,"author":"pizzashill","subreddit":"worldnews","stickied":false,"gilded":0,"body":"http://natoassociation.ca/some-myths-concerning-investor-state-dispute-settlement/\n\nNo clue what you're talking about dude.","subreddit_id":"t5_2qh13","retrieved_on":1486233815,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"link_id":"t3_5p9fwi","distinguished":null,"created_utc":1484998845,"id":"dcplqoc","edited":false,"parent_id":"t1_dcpkux7"}{"id":"dcpn1gs","edited":false,"parent_id":"t1_dcpmh87","distinguished":null,"created_utc":1485002990,"link_id":"t3_5p7uq9","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh0u","retrieved_on":1486234460,"stickied":false,"body":"Not really, the graph I linked showed the increase in value was pretty steady.\n\nThe second graph as well.","gilded":0,"subreddit":"pics","author":"pizzashill","score":2}{"stickied":false,"gilded":0,"body":"Most people really don't, though. That trait isn't found in all of humanity.\n\nPeople don't like to admit their wrong. \n\n","subreddit":"Drama","author":"pizzashill","score":3,"link_id":"t3_5pf9e0","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2rd2l","retrieved_on":1486260583,"created_utc":1485092909,"distinguished":null,"parent_id":"t1_dcqzhst","id":"dcr3m6p","edited":false}{"stickied":false,"gilded":0,"body":"I am baffled as to why these people feel the need to constantly try to screw over people for living their life the way they want to live it.\n\nJust insane, literally insane. This country is a dumpster fire. The hilarious part is these people constantly claim \"Sharia law\" is coming to America, then turn around and try to inject their religion into our laws.\n\nA reminder for every conservative here: Nobody gives a shit about your fairy tale, it has no business dictating how our country functions, period.","subreddit":"news","author":"pizzashill","score":327,"link_id":"t3_5phw3c","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486265753,"created_utc":1485108584,"distinguished":null,"parent_id":"t3_5phw3c","edited":false,"id":"dcrdzxf"}{"created_utc":1485151274,"distinguished":null,"parent_id":"t1_dcrsho6","edited":1485151568,"id":"dcsbnfc","subreddit":"news","stickied":false,"body":"Lmao what?\n\nAt one point did you think this was a valid argument?\n\nThe culture of America is equality for all, and that includes gay people. Your religious views have literally no meaning to our laws.","gilded":0,"score":10,"author":"pizzashill","link_id":"t3_5phw3c","subreddit_id":"t5_2qh3l","retrieved_on":1486282177,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null}{"subreddit_id":"t5_2qh3l","retrieved_on":1486282202,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5phw3c","score":2,"author":"pizzashill","subreddit":"news","body":"Uh, freedom of speech? People can call you out all they want, and a business refusing to serve people very well could be a civil rights violation.\n\nSo no, both sides do not do it.\n\nNobody even shut those stores down, people rightly called them out, that is in no way the same as conservatives trying to literally ban gay marriage.","stickied":false,"gilded":0,"edited":false,"id":"dcsbpdv","parent_id":"t1_dcrhwzk","distinguished":null,"created_utc":1485151378}{"author":"pizzashill","score":6,"body":"The fact you seem to think your religious dislike of gay marriage is \"American culture.\"\n\nLast time I checked, equality is American culture, meaning gay marriage is part of American culture.","stickied":false,"gilded":0,"subreddit":"news","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486282347,"link_id":"t3_5phw3c","created_utc":1485151949,"distinguished":null,"parent_id":"t1_dcsbyo9","id":"dcsc07d","edited":false}{"score":9,"author":"pizzashill","subreddit":"news","body":"Yeah, you're a moron dude, that \"gay people can marry the opposite sex\" line is one straight out of the pre-civil rights era when people would say \"black people are equal, they can marry other black people.\"\n\nYou should be ashamed of yourself.","stickied":false,"gilded":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486282527,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"link_id":"t3_5phw3c","distinguished":null,"created_utc":1485152667,"id":"dcscdrw","edited":false,"parent_id":"t1_dcscbl8"}{"parent_id":"t1_dcscjq4","edited":false,"id":"dcscn9z","created_utc":1485153199,"distinguished":null,"link_id":"t3_5phw3c","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486282654,"body":"Where at any point did I attack anyone personally?\n\nI said your fairy tale has no business in our laws, that isn't a personal attack, it's an objective fact.\n\nNice try though, I don't give a shit if you're gay or not, your party is actively engaged in trying to strip civil rights from gay people.\n\nYou can gymnastics it if you want, but Pence literally tried to jail gay people for getting married, the first SC pick Trump met with wanted to make gay sex illegal.\n\n","stickied":false,"gilded":0,"subreddit":"news","author":"pizzashill","score":15}{"retrieved_on":1486282755,"subreddit_id":"t5_2qh3l","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5phw3c","score":8,"author":"pizzashill","subreddit":"news","body":"You're the person here throwing out word for word the same arguments white nationalists did pre civil rights.\n\nYou don't get to tell other people how they can live their lives, as long as they aren't hurting anyone.\n\nAgain, your fairy tale has no place in our laws, and it never will.","stickied":false,"gilded":0,"parent_id":"t1_dcscsql","edited":false,"id":"dcscuu0","created_utc":1485153618,"distinguished":null}{"created_utc":1485153827,"distinguished":null,"parent_id":"t1_dcscxit","edited":false,"id":"dcscyk6","score":3,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"Give me a single valid reason to be against gay marriage without citing religion.","retrieved_on":1486282805,"subreddit_id":"t5_2qh3l","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5phw3c"}{"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486282824,"link_id":"t3_5phw3c","author":"pizzashill","score":16,"stickied":false,"gilded":0,"body":"What do you agree with when it comes to the GOP?\n\nIs it the gay conversion therapy?\n\nIs it the attempts to ban gay marriage, and strip gay people of couples benefits?\n\nIf the GOP was actually fiscally conservative, your argument might hold water, but they aren't, so it doesn't. Give me a single valid reason for supporting the GOP.","subreddit":"news","edited":false,"id":"dcsd00m","parent_id":"t1_dcscwl3","distinguished":null,"created_utc":1485153906}{"author":"pizzashill","score":5,"gilded":0,"stickied":false,"body":"That's exactly what I thought, you're nothing but a disgusting fucking religious bigot.\n\nYou have no reason.\n\nFreedom is what this country is about, people should be allowed to do whatever they want as long as they aren't hurting anyone, and gay people getting married has no impact on you, your life, or anyone else's life. You can keep your 1920s culture.","subreddit":"news","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486282909,"link_id":"t3_5phw3c","created_utc":1485154275,"distinguished":null,"parent_id":"t1_dcsd1cx","edited":false,"id":"dcsd6fp"}{"score":4,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"Cya, religious bigot.","subreddit_id":"t5_2qh3l","retrieved_on":1486283040,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5phw3c","created_utc":1485154851,"distinguished":null,"parent_id":"t1_dcsdd72","id":"dcsdg7p","edited":false}{"id":"dcsdyeq","edited":false,"parent_id":"t1_dcsdvuo","distinguished":null,"created_utc":1485155978,"link_id":"t3_5phw3c","subreddit_id":"t5_2qh3l","retrieved_on":1486283282,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"news","body":"If people see any more harm in gay relationships than straight relationships they're just stupid people.","stickied":false,"gilded":0,"score":5,"author":"pizzashill"}{"parent_id":"t1_dcrdfgn","edited":false,"id":"dcsi34v","created_utc":1485167550,"distinguished":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486285264,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5phjg9","score":8,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"A shorter version:\n\n&gt;&gt; \"In an ever-changing, incomprehensible world the masses had reached the point where they would, at the same time, believe everything and nothing, think that everything was possible and that nothing was true. ... Mass propaganda discovered that its audience was ready at all times to believe the worst, no matter how absurd, and did not particularly object to being deceived because it held every statement to be a lie anyhow. The totalitarian mass leaders based their propaganda on the correct psychological assumption that, under such conditions, one could make people believe the most fantastic statements one day, and trust that if the next day they were given irrefutable proof of their falsehood, they would take refuge in cynicism; instead of deserting the leaders who had lied to them, they would protest that they had known all along that the statement was a lie and would admire the leaders for their superior tactical cleverness.\" Hannah Arendt, The Origins of Totalitarianism"}{"author":"pizzashill","score":4,"gilded":0,"stickied":false,"body":"&gt;&gt; Fiscal conservancy\n\nThe GOP is not fiscally conservative, even looking at a simple graph proves that.\n\nhttp://www.macrotrends.net/2023/national-debt-by-president\n\n&gt;&gt; libertarianism\n\nWhat's libertarian about trying to deny people civil rights?\n\n&gt;&gt;  have only ever experienced homophobia (including being attacked outside my highschool and receiving death threats) by Democrats.\n\nThe GOP literally has gay conversion therapy on their platform and has constantly attacked gay people over the years.\n\nPence tried to jail gay people for getting married.\n\nTrump's first SC interview was a guy that wants to **ban gay sex.**\n\nWho the hell do you think you're fooling?\n\n&gt;&gt; I'm also sick of the wars in the middle East\n\nSo you vote for the warhawk party? Funny, you realize war is one of the main reasons the economy is always better under a democrat, right?\n\nhttp://www.factcheck.org/2015/10/clinton-economy-better-under-democrats/\n\n&gt;&gt; “One reason for superior performance under Democratic presidents is that oil prices go up less (on average),” Blinder stated. “Is that just luck? Well, the fact that we entered several wars in the gulf area (the latest in 2003) under Republican presidents, thereby driving up oil prices, was not just luck — it was policy, though not economic policy.”\n\n&gt;&gt; “The second main factor underpinning Democratic superiority is that productivity has risen faster under Democrats,” Blinder said. “Well, productivity growth depends on many things, including luck, but also including a myriad of policies.”\n\nNice.\n\n&gt;&gt; do not want to go to war with russia and believe we need to invest our money in infrastructure. This used to be the democratic platform but this election it flipped.\n\nNobody was ever going to war with Russia, that's just blatant propaganda.\n\nLiterally lying, the DNC has been pushing infrastructure spending for years, and still is, the republicans block it/are against it.\n\nWhy do you just lie and think nobody will call you on it?\n\nhttp://www.thefiscaltimes.com/2015/03/25/478B-Infrastructure-Bill-Blocked-Senate-GOP\n\nHere's one right here.\n\n&gt;&gt; There, I gave you several reasons. Please stop spreading hate and division.\n\nWell, you tried, sadly for you, every single one of them was wrong, and easily proven wrong by data and facts.\n\n\n\n\n\n","subreddit":"news","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486288371,"link_id":"t3_5phw3c","distinguished":null,"created_utc":1485181933,"id":"dcsokf7","edited":1485182239,"parent_id":"t1_dcsodwz"}{"distinguished":null,"created_utc":1485183257,"edited":false,"id":"dcsph30","parent_id":"t1_dcsp969","score":1,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"&gt;&gt; Why do you keep talking about federal. I don't vote for the president, I vote and work in local government.\n\nThat's awesome, all the things I said that apply there too, blue states are better off than red states.\n\n\n&gt;&gt; Having said that, pretty sure under Obama we expanded our wars in the middle East and engaged in a proxy war with Russia. Why would I vote for a party that is pushing this.\n\nExpand them? Lmao what? The only thing Obama did was respond to Russia literally stealing land from another country.\n\nAnd you're lucky Obama was there, the GOP called him a coward and wanted war.\n\n\n&gt;&gt; What civil rights will anyone lose? Pretty sure everything has been accomplished. We have gay marriage, legal abortions. There's nothing left to fight for.\n\n\nYou realize literally all of those things are currently under attack by the GOP, correct?\n\n\n&gt;&gt; Please stop being so hateful, lighten up friend! It's gonna be okay!\n\nYeah, calling out your clear bullshit means I'm \"hateful.\"\n\n\n","subreddit_id":"t5_2qh3l","retrieved_on":1486288805,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5phw3c"}{"edited":false,"id":"dcsql91","parent_id":"t1_dcsqi7w","distinguished":null,"created_utc":1485184777,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"retrieved_on":1486289341,"subreddit_id":"t5_2qh3l","link_id":"t3_5phw3c","author":"pizzashill","score":0,"stickied":false,"gilded":0,"body":"&gt;&gt; Russia returned land that wanted to be and historically has been a part of Russia.\n\nAnd stopped reading, you're delusional.","subreddit":"news"}{"body":"If you want to understand Russia, you should read this book:\n\nhttps://www.amazon.com/Nothing-True-Everything-Possible-Surreal/dp/1610396006","stickied":false,"gilded":0,"subreddit":"news","author":"pizzashill","score":1,"link_id":"t3_5pid96","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486290532,"distinguished":null,"created_utc":1485187663,"edited":false,"id":"dcssx2t","parent_id":"t1_dcrehok"}{"subreddit":"news","stickied":false,"gilded":0,"body":"Nice, now the zealots are going after HS as well.\n\nIt isn't enough that the entire education system is heavily skewed towards women, it isn't enough that women are over 60% of the college population, it isn't enough that there's a grading bias in favor of girls, or a punishment bias against boys.\n\nNow we've got to also attempt to ram through misleading sexual assault \"courses\" or \"videos\" riddled with fake statistics, often times  claiming women are the default victims of sexual assault.\n\nEven this article confirms my point: **Women are told to stay safe, but men are not necessarily told to make sure they obtain consent and respect a partner's boundaries.**\n\nOf course, this ignores the fact men are about 50% of rape victims, more counting prison, or, you know: \n\nhttp://www.uptownmagazine.com/2014/03/study-reveals-a-growing-number-men-being-raped-by-women-male-rape/","score":4,"author":"pizzashill","link_id":"t3_5prfjl","subreddit_id":"t5_2qh3l","retrieved_on":1486297797,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"distinguished":null,"created_utc":1485204356,"id":"dct82uo","edited":false,"parent_id":"t3_5prfjl"}{"id":"dctzquy","edited":false,"parent_id":"t1_dct9e9k","distinguished":null,"created_utc":1485240562,"link_id":"t3_5prfjl","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486311078,"stickied":false,"gilded":0,"body":"Incorrect, according to data.","subreddit":"news","author":"pizzashill","score":1}{"author":"pizzashill","score":54,"body":"Holy shit, this website. Trump literally thinks vaccines cause autism and climate change is a hoax, he's gone on the Alex Jones show.\n\nHe is not a smart person.\n\nhttps://en.wikipedia.org/wiki/Argumentum_ad_crumenam\n\nTrump was born to a rich family, handed a large company in a booming market, he's shown countless times to be horribly incompetent.\n\nHe won an election because large chunks of America are basically functionally disabled and have no critical thinking ability at all.\n","stickied":false,"gilded":0,"subreddit":"worldnews","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486311855,"link_id":"t3_5psxxq","distinguished":null,"created_utc":1485244476,"edited":false,"id":"dcu1d2i","parent_id":"t1_dctwz6w"}{"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486312043,"link_id":"t3_5psxxq","author":"pizzashill","score":6,"body":"&gt;&gt; He did not inherit his empire. Yes, starting with a million bucks was a crazy sum\n\nA million? Lmao.\n\nHe was handed **many** millions, and a large company.\n\n&gt;&gt; but you have to know the economy and be highly intelligent in your field to turn it into a billions-of-dollars business. It is the non-critical thinkers that took every fucking piece of overblown 'news' for a fact.\n\nhttp://blogs.wsj.com/economics/2016/11/01/prominent-economists-including-eight-nobel-laureates-do-not-vote-for-donald-trump/\n\nhttp://blogs.wsj.com/economics/2016/08/22/hillary-clinton-donald-trump-or-gary-johnson-u-s-business-economists-have-a-strong-preference/\n\nhttp://blogs.wsj.com/economics/2016/08/25/what-former-white-house-economists-say-about-donald-trump-and-hillary-clinton/\n\nhttp://www.igmchicago.org/surveys/100-day-plan\n\n\n&gt;&gt; Good job. I was left leaning once, but people like you are the reason a whole lot of old lefties like me are becoming more conservative leaning every day. Good damned job.\n\nI hate to break this to you, but if you voted for an economically illiterate Alex jones caliber conspiracy theorist you clearly have problems.\n\nHere's what you did:\n\nhttps://www.axios.com/axios-am-2207230091.html\n\n&gt;&gt; **Listed as initiatives to stop: \"Clean Air Act greenhouse gas regulations for new (NSPS) and existing (ESPS or the 'Clean Power' Plan) coal and natural gas power plants** … [CAFE] Standards … Clean Water Section 404: Waters of the U.S. Rule (wetlands) … TMDL (Total Maximum Daily Load) for Chesapeake Bay.\n\n&gt;&gt; \"Key opportunities\": \"Issue an executive order barring EPA from overruling federal/state regulatory/permit decisions unless in clear violation of established law.\"\n\n&gt;&gt; **Changing the way the EPA uses science: \"Unless major reforms of the agency's use of science and economics are achieved, EPA will be able to return to its bad old ways as soon as an establishment administration takes office.\"**\n\n","stickied":false,"gilded":0,"subreddit":"worldnews","id":"dcu1r8e","edited":false,"parent_id":"t1_dcu1pi4","distinguished":null,"created_utc":1485245518}{"retrieved_on":1486312101,"subreddit_id":"t5_2qh1i","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5pv0md","score":0,"author":"pizzashill","subreddit":"AskReddit","stickied":false,"gilded":0,"body":"Donald Trump understands basic economics.","parent_id":"t3_5pv0md","id":"dcu1vht","edited":false,"created_utc":1485245828,"distinguished":null}{"link_id":"t3_5psxxq","retrieved_on":1486312401,"subreddit_id":"t5_2qh13","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"worldnews","body":"&gt;&gt; All later inheritances were after he had alrewdy multiplied his initial 1 million he started with. \n\nThis is just false dude, his dad was literally bailing him out left and right.\n\nhttp://www.nydailynews.com/news/politics/trump-dad-bailed-1970s-avoid-bankruptcy-article-1.2818893\n\n&gt;&gt; All you have pointed at me in links are that specific people did not vote for him\n\nDo you seriously think the entire academic field of economics is just rigged against Donald Trump?\n\nThis anti-intellectual bullshit where you people think your opinions are on par with economists is just insane.\n\nDo you think economic fundamentals are just subjective?\n\n&gt;&gt; Projecting again? You're not making a good case dor yourself. I know that he denies global warming. It is on the list of weaknesses. Does not mean the man doesn't have economic strengths.\n\nLiterally just linked you the most credible economists in the country saying he has no idea what he's talking about dude, you understand that, correct?\n\nNot only that: **CLIMATE CHANGE IS OUR LARGEST ECONOMIC THREAT.**\n\nhttps://www.theguardian.com/business/2016/jan/14/climate-change-disaster-is-biggest-threat-to-global-economy-in-2016-say-experts\n\n\n","stickied":false,"gilded":0,"score":9,"author":"pizzashill","edited":false,"id":"dcu2i5e","parent_id":"t1_dcu2evx","distinguished":null,"created_utc":1485247591}{"created_utc":1485247884,"distinguished":null,"parent_id":"t1_dcu2ku8","edited":false,"id":"dcu2lvq","stickied":false,"body":"&gt;&gt; The funny thing here is that I'm not even pro-Trump. I just dislike incredibly onesided, non-reflective, aggressive, insult-spewing one track thinking like yours.\n\nAlso known as citing credible experts?\n\n&gt;&gt; Money does not multiply itself.\n\nIf you have enough money, yes, it actually does pretty much multiply by itself, that's pretty much exactly how rich people stay rich.\n\nhttp://fortune.com/2015/08/20/donald-trump-index-funds/\n\nGuy did worse than the market did.\n\n","gilded":0,"subreddit":"worldnews","author":"pizzashill","score":4,"link_id":"t3_5psxxq","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486312451}{"author":"pizzashill","score":9,"stickied":false,"gilded":0,"body":"TIL citing credible experts is \"mental gymnastics.\"\n\nMaybe you can teach me how to gymnastics, like for example, how to deny objective reality and entire academic fields of study because they tell me I'm wrong.","subreddit":"worldnews","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486312480,"subreddit_id":"t5_2qh13","link_id":"t3_5psxxq","created_utc":1485248057,"distinguished":null,"parent_id":"t1_dcu2n72","id":"dcu2o29","edited":false}{"edited":false,"id":"dcu2pyq","parent_id":"t1_dcu2oip","distinguished":null,"created_utc":1485248211,"link_id":"t3_5psxxq","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"retrieved_on":1486312506,"subreddit_id":"t5_2qh13","gilded":0,"stickied":false,"body":"You seriously don't seem to understand how Trump made his money, you keep trying to lie about this \"million dollars\" when in reality it was many millions, and bail outs from his father.\n\nAnd yeah, the real estate market was nuts when Trump came onto the scene. You seem to really just not understand how money works.\n\nIf someone gives you a few million dollars, it isn't hard to grow that money.\n\nhttp://www.investopedia.com/updates/donald-trump-rich/\n\nHere you go. The guy invested the money he got from daddy in a booming real estate market, they paid off. He isn't some economic genius.","subreddit":"worldnews","author":"pizzashill","score":7}{"created_utc":1485248860,"distinguished":null,"parent_id":"t1_dcu2vzg","id":"dcu2y2n","edited":false,"author":"pizzashill","score":5,"stickied":false,"gilded":0,"body":"M8, anyone that can look at Donald Trump, see how much of a clown he is, see him go on the Alex Jones show, hear him speak at a 3rd grade level, see all the economists saying he's a bad idea and then say \"you know what, Trump is a good choice for president.\"\n\nThen I'm going to suspect there's something wrong with that person, they're either blindly loyal to their party, or they don't care about facts.\n\nThere's just no logical way to ever conclude Hillary Clinton is anywhere near as bad as Donald Trump, and I don't even like Clinton.\n\nAnd you know what, this doesn't do much to change my views:\n\nhttp://fivethirtyeight.com/features/education-not-income-predicted-who-would-vote-for-trump/\n","subreddit":"worldnews","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486312614,"link_id":"t3_5psxxq"}{"created_utc":1485249979,"distinguished":null,"parent_id":"t1_dcu33x6","edited":false,"id":"dcu3brf","subreddit":"worldnews","stickied":false,"gilded":0,"body":"I notice you failed to refute a single thing I said.","score":1,"author":"pizzashill","link_id":"t3_5psxxq","subreddit_id":"t5_2qh13","retrieved_on":1486312797,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null}{"distinguished":null,"created_utc":1485249994,"edited":false,"id":"dcu3bxk","parent_id":"t1_dcu32sa","author":"pizzashill","score":4,"gilded":0,"stickied":false,"body":"No thank you, your ad hominems in place is valid arguments aren't relevant to me.\n\nFacts are not subjective, no matter how badly you wish they were.","subreddit":"worldnews","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"retrieved_on":1486312799,"subreddit_id":"t5_2qh13","link_id":"t3_5psxxq"}{"created_utc":1485250494,"distinguished":null,"parent_id":"t1_dcu3ejt","id":"dcu3htz","edited":false,"author":"pizzashill","score":2,"stickied":false,"body":"Last time I checked, I am literally the only person here that has provided actual expert opinion, but nice try.","gilded":0,"subreddit":"worldnews","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486312879,"link_id":"t3_5psxxq"}{"id":"dcu3rfh","edited":false,"parent_id":"t1_dcu3prz","distinguished":null,"created_utc":1485251308,"link_id":"t3_5psxxq","subreddit_id":"t5_2qh13","retrieved_on":1486313006,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit":"worldnews","stickied":false,"body":"I don't think they're all mentally disabled, a fair amount probably voted based on pure party loyalty, but then again, the GOP is an international laughing stock so being loyal to the GOP might be a sign of mental disability.","gilded":0,"score":1,"author":"pizzashill"}{"link_id":"t3_5psxxq","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486313221,"subreddit_id":"t5_2qh13","stickied":false,"gilded":0,"body":"&gt;&gt; As long as we can appreciate the hypocrisy of calling everyone who voted for someone you disagree with \"mentally disabled\" and then crying about ad hominem two posts later.\n\nYou seem to be confused, you think I view them as disabled because they disagree with me, no, I do not.\n\nTons of smart people disagree with me, I respect them, as long as it's valid disagreement.\n\nBut when you declare climate change a hoax.\n\nWhen you deny evolution.\n\nBasic economics, you deny objective reality? That's not you disagreeing, that's you simply not wanting to accept facts because they conflict with your world view.\n\nBig difference.\n\n&gt;&gt; This is my sincere argument, reasoned and civil responses only please, no ad hominem like we'd expect from your dirty kind.\n\nThere's something hilarious about someone that doesn't understand what ad hominem is and just uses it incorrectly, over and over again.\n","subreddit":"worldnews","author":"pizzashill","score":1,"parent_id":"t1_dcu3z2r","edited":1485252896,"id":"dcu47n0","created_utc":1485252715,"distinguished":null}{"link_id":"t3_5psxxq","subreddit_id":"t5_2qh13","retrieved_on":1486313366,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"worldnews","stickied":false,"gilded":0,"body":"Yeah, ready for this?\n\n&gt;&gt; \"In an ever-changing, incomprehensible world the masses had reached the point where they would, at the same time, believe everything and nothing, think that everything was possible and that nothing was true. ... Mass propaganda discovered that its audience was ready at all times to believe the worst, no matter how absurd, and did not particularly object to being deceived because it held every statement to be a lie anyhow. The totalitarian mass leaders based their propaganda on the correct psychological assumption that, under such conditions, one could make people believe the most fantastic statements one day, and trust that if the next day they were given irrefutable proof of their falsehood, they would take refuge in cynicism; instead of deserting the leaders who had lied to them, they would protest that they had known all along that the statement was a lie and would admire the leaders for their superior tactical cleverness.\" Hannah Arendt, The Origins of Totalitarianism","score":4,"author":"pizzashill","parent_id":"t1_dcu496g","edited":false,"id":"dcu4c4y","created_utc":1485253098,"distinguished":null}{"subreddit_id":"t5_2qh13","retrieved_on":1486313412,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5psxxq","score":1,"author":"pizzashill","subreddit":"worldnews","stickied":false,"body":"I have valid reasons for believing them to be dumb, reasons I already laid out.\n\nThat is not an ad hominem, here's a free lesson for you.\n\nIf someone says \"2+2=5\" and I say \"you're an idiot\" that is an ad hominem,'\n\nIf someone says \"2+2=5\" and I say \"no, it's 4, you god damn idiot\" then that is not an ad hominem.\n\nYou can insult someone, as long as the argument is addressed, friend. ","gilded":0,"parent_id":"t1_dcu4e5y","id":"dcu4fm5","edited":false,"created_utc":1485253387,"distinguished":null}{"distinguished":null,"created_utc":1485253585,"edited":false,"id":"dcu4hyu","parent_id":"t1_dcu4gm2","subreddit":"worldnews","gilded":0,"stickied":false,"body":"Not really, it requires some kind of problem to think Trump should be president.","score":1,"author":"pizzashill","link_id":"t3_5psxxq","subreddit_id":"t5_2qh13","retrieved_on":1486313443,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null}{"link_id":"t3_5prfjl","retrieved_on":1486314699,"subreddit_id":"t5_2qh3l","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"news","stickied":false,"gilded":0,"body":"Even the CDC report shows men are about 50% of rape victims, and women are at least 40% of rapists.","score":1,"author":"pizzashill","id":"dcu745p","edited":false,"parent_id":"t1_dcu72rg","distinguished":null,"created_utc":1485260947}{"link_id":"t3_5psxxq","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"retrieved_on":1486314706,"subreddit_id":"t5_2qh13","gilded":0,"stickied":false,"body":"Literally delusional dude.\n\nHe straight up tried to lie about a crowd the other day.\n\nTrump IS the mass propaganda, he's managed to scream fake news at everything, even true stories about himself, to the point his base thinks everything negative about him is a lie.","subreddit":"worldnews","author":"pizzashill","score":4,"parent_id":"t1_dcu6ufa","edited":false,"id":"dcu74pi","created_utc":1485260981,"distinguished":null}{"distinguished":null,"created_utc":1485262351,"edited":false,"id":"dcu7qry","parent_id":"t1_dcu7md7","body":"&gt;&gt; That doesn't disprove my claim at all.\n\nBut it literally does.\n\n&gt;&gt; Even so, wouldn't that be all the more reason to educate early?\n\nSure, are you also in support of \"teach women not to throw their babies in dumpsters\" and \"teach people not to murder\" and \"teach people not to steal\" classes?\n\nOh, you mean those are stupid? Yeah, they are. People don't sexually assault others by mistake, friend.\n\nSomeone isn't going to stop themselves from raping someone and think to themselves \"oh, that class told me I shouldn't rape, I better not do it!\"\n","stickied":false,"gilded":0,"subreddit":"news","author":"pizzashill","score":1,"link_id":"t3_5prfjl","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"retrieved_on":1486315000,"subreddit_id":"t5_2qh3l"}{"link_id":"t3_5psxxq","subreddit_id":"t5_2qh13","retrieved_on":1486315112,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit":"worldnews","body":"Are you trolling?\n\nI don't need the media to tell me Trump is a moron and a liar.\n\nThat was evident when he claimed vaccines cause autism.\n\nThat was evident when he claimed climate change was a hoax.\n\nIt was evident when he claimed Obama wasn't a US citizen.\n\nAnd there are hundreds more, the man is a profoundly ignorant, pathological liar. \n\n&gt;&gt; If the mass media propaganda apparatus was for trump, you wouldn't even think you know about the crowd size thing.\n\n\n**THE FUCKING MEDIA REPORTS CROWD SIZE EVERY ELECTION.**\n\nHe got upset because his crowd was **OBVIOUSLY SMALLER** and started trying to lie.\n\n","stickied":false,"gilded":0,"score":3,"author":"pizzashill","parent_id":"t1_dcu7w6n","id":"dcu7ypx","edited":false,"created_utc":1485262803,"distinguished":null}{"parent_id":"t1_dcu8d67","edited":false,"id":"dcu8j4g","created_utc":1485263932,"distinguished":null,"subreddit_id":"t5_2qh13","retrieved_on":1486315384,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5psxxq","score":4,"author":"pizzashill","subreddit":"worldnews","body":"&gt;&gt; I don't think you're using that fallacy correctly. When did I mention money?\n\nThe comment you replied to was literally talking about his wealth.\n\n&gt;&gt; Just because he was born to a rich family doesn't guarantee him success in his businesses. Also, a booming market doesn't guarantee success either.\n\nA learning disabled child could strike it big in 1980s Manhatten with daddy paying the bills.\n\n&gt;&gt; Are you saying anyone who is given his set of circumstances would have succeed? \n\nAbsolutely.\n\n&gt;&gt;  What I see is a guy who took the advantage he already had and built on them, and built himself into a huge success. \n\nLiterally performed worse than the market did.\n\n&gt;&gt; But to say he's incompetent is naive. He says dumb shit and maybe from a politics standpoint he doesn't know his knee from his elbow, but that doesn't change he fact that he's a hugely successful business man...oh, who just happened to now be elected president of the US.\n\nThe guy literally claimed vaccines cause autism and has shown himself to be both scientifically and economically illiterate.\n\nSeriously, I am telling you right now, he won an election because the general population is just dumb, rural America is dumb.\n\nhttps://www.youtube.com/watch?v=Az1JyDJ_iKU\n\nSam Harris says it best.","stickied":false,"gilded":0}{"subreddit_id":"t5_2qh13","retrieved_on":1486315548,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5psxxq","score":2,"author":"pizzashill","subreddit":"worldnews","stickied":false,"body":"Right, which is why those same people also voted for the same establishment GOPers in every other election.\n\nTrump won because he's a con artist that managed to con dumb ass rural Americans.","gilded":0,"id":"dcu8vep","edited":false,"parent_id":"t1_dcu8tp9","distinguished":null,"created_utc":1485264561}{"author":"pizzashill","score":1,"gilded":0,"stickied":false,"body":"&gt;&gt; You claim that 50% of rape victims are male. But, there is no indication of gender for the perpetrator here.\n\nUh.. 80% of those male victims reported a female attacker.\n\n&gt;&gt; You claim that at least 40% of rapists are women. 40% is not a majority.\n\nI didn't say women were a majority, but men are not the \"vast majority\" as you claimed.\n\nhttps://news.ycombinator.com/item?id=5414518\n\n&gt;&gt; Telling women not to throw their babies in a dumpster? That's a pretty telling statement, with more than a hint of misogyny. Not to mention that thorough sexual education could literally prevent this from occurring via teaching about contraceptives, reducing stigma, and teaching about options and resources available for unwanted pregnancies.\n\nI WAS LITERALLY THROWING A RANDOM THING OUT TO SHOW HOW STUPID YOUR ARGUMENT WAS.\n\n&gt;&gt; Cynical, defeatist attitudes will do nothing to help.\n\nYou people lost the right to discuss sex education and sexual assault when kangaroo courts popped up and sexist videos started being shown in class rooms.\n\n\n","subreddit":"news","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486316534,"link_id":"t3_5prfjl","distinguished":null,"created_utc":1485267902,"id":"dcuawvy","edited":false,"parent_id":"t1_dcuaph9"}{"stickied":false,"gilded":0,"body":"Holy shit, are you like illiterate dude?\n\nRight here, I'm going to point this out and then walk away, to fully display how fucking dumb you are.\n\n&gt;&gt; All of wsj is biased against Trump.\n\n#NOTHING I LINKED IS FROM WSJ, IT'S THEM REPORTING WHAT ECONOMISTS SAY.\n\n&gt;&gt;  I've never heard something like that before. I can go on an on. Oh and btw Fred Trump was worth about 300 mil in 1999 before he died. Donald Trump is worth about 5 billion right now. Explain to me how Fred is the reason Donald is a billionaire.\n\nLMAO, clueless.\n\nYou people voted for an economically illiterate clown, ready for this? \n\nhttp://bigstory.ap.org/article/265cd8fb02fb44a69cf0eaa2063e11d9/mexico-taking-us-factory-jobs-blame-robots-instead\n\n&gt;&gt; But research shows that the automation of U.S. factories is a much bigger factor than foreign trade in the loss of factory jobs. A study at Ball State University's Center for Business and Economic Research last year found that trade accounted for just 13 percent of America's lost factory jobs. The vast majority of the lost jobs — 88 percent — were taken by robots and other homegrown factors that reduce factories' need for human labor.\n\"We're making more with fewer people,\" says Howard Shatz, a senior economist at the Rand Corp. think tank. General Motors, for instance, now employs barely a third of the 600,000 workers it had in the 1970s. Yet it churns out more cars and trucks than ever.\n\n&gt;&gt; In a survey by the consulting firm Deloitte, global manufacturing executives predicted that that the United States — now No. 2 — will overtake China as the most competitive country in manufacturing by 2020. (Competitiveness is measured by such factors as costs, productivity and the protection of intellectual property.)\nThe Reshoring Initiative, a nonprofit that lobbies manufacturers to return jobs to the United States, says America was losing an average of 220,000 net jobs a year to other countries a decade ago. Now, the number being moved abroad is roughly offset by the number that are coming back or being created by foreign investment.\n\nGet an education, clown.\n\nPS: The TPP was to contain China, they were not involved with the TPP.","subreddit":"worldnews","author":"pizzashill","score":0,"link_id":"t3_5psxxq","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486403309,"distinguished":null,"created_utc":1485283408,"id":"dcunzp5","edited":1485283683,"parent_id":"t1_dcunk6m"}{"parent_id":"t1_dcv4br2","id":"dcvlp7z","edited":false,"created_utc":1485325812,"distinguished":null,"subreddit_id":"t5_2qh13","retrieved_on":1486419813,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5psxxq","score":1,"author":"pizzashill","subreddit":"worldnews","stickied":false,"gilded":0,"body":"Should probably learn what an \"ad hominem is.\""}{"gilded":0,"stickied":false,"body":"I've seen many Trumpers say \"who cares! We need to get the economy going!\"\n\nThis mentality is amazing to me, not only does it show they have no idea what they're talking about in relation to the economy, it shows they think science does anything other than improve the economy.","subreddit":"skeptic","author":"pizzashill","score":3,"link_id":"t3_5pz0hz","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486420359,"subreddit_id":"t5_2qj8f","created_utc":1485328135,"distinguished":null,"parent_id":"t3_5pz0hz","id":"dcvmt18","edited":false}{"subreddit":"worldnews","stickied":false,"body":"You aren't a skeptic dude.\n\nSkeptics base their opinions on what the current facts say. They're open to new information, but they still listen to the facts.\n\nWhen you deny thousands of studies, you aren't being a skeptic. It's like if someone claims vaccines cause autism, that person isn't simply a \"skeptic.\"\n\nThe only reason you deny climate change is because your tribe denies climate change. No other reason.","gilded":0,"score":14,"author":"pizzashill","link_id":"t3_5q9ogw","subreddit_id":"t5_2qh13","retrieved_on":1486455453,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"distinguished":null,"created_utc":1485443880,"id":"dcxnl2y","edited":1485444193,"parent_id":"t1_dcxmds9"}{"stickied":false,"body":"You should probably avoid speaking on subjects you're uneducated on.\n\nThey're still melting. https://www.nasa.gov/feature/goddard/2016/arctic-sea-ice-is-losing-its-bulwark-against-warming-summers","gilded":0,"subreddit":"worldnews","author":"pizzashill","score":0,"link_id":"t3_5q9ogw","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486455503,"created_utc":1485444008,"distinguished":null,"parent_id":"t1_dcxmvbi","id":"dcxnour","edited":false}{"distinguished":null,"created_utc":1485444086,"id":"dcxnr9u","edited":false,"parent_id":"t1_dcxnl53","score":1,"author":"pizzashill","subreddit":"worldnews","body":"&gt;&gt; The point that's important is the information is in direct conflict with predictive models.\n\nNo.. it isn't. \n\nhttps://skepticalscience.com/antarctica-gaining-ice.htm\n\n","stickied":false,"gilded":0,"subreddit_id":"t5_2qh13","retrieved_on":1486455535,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5q9ogw"}{"score":3,"author":"pizzashill","subreddit":"worldnews","stickied":false,"body":"&gt;&gt; Funny you accuse me of being uneducated on a topic when the article you linked is not relevant to the one I linked, and also from the same source.\n\nYou literally tried to cite that NASA study as some kind of evidence the models are wrong.\n\n&gt;&gt; Let's say the new article completely contradicted the first, then it would still agree with my hypothesis that the predictive models are inaccurate due to ignorance on the topic, as evidenced by two NASA sources contradicting each other within only one years timeframe.\n\nHow many more times are you going to try to lie about the models, here?\n\n&gt;&gt; This is called confirmation bias. It's where you disregard information that invalidates your belief.\n\nYou literally tried to lie about the models, you didn't understand the study and thought it supported your claim, it doesn't.\n\nThe loss of sea ice exceeds the gain of land ice, this is fine with the models.","gilded":0,"subreddit_id":"t5_2qh13","retrieved_on":1486455721,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5q9ogw","distinguished":null,"created_utc":1485444558,"id":"dcxo569","edited":false,"parent_id":"t1_dcxnxxo"}{"subreddit_id":"t5_2qh13","retrieved_on":1486455928,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5q9ogw","score":2,"author":"pizzashill","subreddit":"worldnews","gilded":0,"stickied":false,"body":"The models predicted a loss of ice, and it is in fact losing ice.\n\nThis is some weird mental gymnastics you're trying to use here. \n\n&gt;&gt; So, what is actually happening in Antarctica? The Antarctic is not warming as fast as the Arctic is, said Zwally, who led the NASA study. \"It's more like the global change [rates],\" Zwally said. In other words, the Antarctic region is seeing a regional temperature rise that matches the temperature rise seen on average around the world, instead of the much higher temperature rise in the Arctic regions noted by NOAA. Scientists think the Antarctic region is experiencing a slower temperature rise than the Arctic, because the ozone hole over Antarctic has created weather trends, specifically in East Antarctica, that has slowed it down.\n\n&gt;&gt; East Antarctica is not warming as fast as West Antarctica — that's the part of Antarctica that is the most susceptible to ice loss,\" Mann said. In 2007, researchers reported in the journal Geophysical Research Letters that they had found a link between this phenomenon and the ozone hole over Antarctica. Depleting ozone in the upper atmosphere changes wind dynamics there, Mann said. That change causes a strengthening of the jet stream and the polar winds, but it also traps the cold air in the regions around East Antarctica, creating a cooling effect.\n\n\n\nhttp://www.livescience.com/52831-antarctica-gains-ice-but-still-warming.html","parent_id":"t1_dcxodrk","id":"dcxoks0","edited":false,"created_utc":1485445075,"distinguished":null}{"created_utc":1485453235,"distinguished":null,"parent_id":"t1_dcxvvdv","id":"dcxvzbe","edited":false,"author":"pizzashill","score":2,"gilded":0,"stickied":false,"body":"Not really sure how this is a \"crisis.\"\n\nThe goal of science is to interrogate the world and understand how it works.\n\nSomething being proven wrong in science is a good thing. Your argument seems to be a \"I don't like what science says, so I'm going to try to pretend science isn't credible.\"\n\nNo matter what, science is always going to be the best way to understand the world.","subreddit":"worldnews","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh13","retrieved_on":1486459481,"link_id":"t3_5q9ogw"}{"created_utc":1485453877,"distinguished":null,"parent_id":"t1_dcxwh8i","id":"dcxwkrw","edited":false,"subreddit":"worldnews","stickied":false,"body":"I don't watch ted videos, sorry.","gilded":0,"score":1,"author":"pizzashill","link_id":"t3_5q9ogw","retrieved_on":1486459767,"subreddit_id":"t5_2qh13","author_flair_text":null,"author_flair_css_class":null,"controversiality":0}{"id":"dczrcx8","edited":false,"parent_id":"t1_dczm26d","distinguished":null,"created_utc":1485550580,"subreddit_id":"t5_2rd2l","retrieved_on":1486491938,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5qhw5w","score":18,"author":"pizzashill","subreddit":"Drama","body":"http://slatestarcodex.com/2014/09/30/i-can-tolerate-anything-except-the-outgroup/\n\n&gt;&gt; Research suggests Blue Tribe / Red Tribe prejudice to be much stronger than better-known types of prejudice like racism. Once the Blue Tribe was able to enlist the blacks and gays and Muslims in their ranks, they became allies of convenience who deserve to be rehabilitated with mildly condescending paeans to their virtue. “There never was a coward where the shamrock grows.”\n\n&gt;&gt; Spending your entire life insulting the other tribe and talking about how terrible they are makes you look, well, tribalistic. It is definitely not high class. So when members of the Blue Tribe decide to dedicate their entire life to yelling about how terrible the Red Tribe is, they make sure that instead of saying “the Red Tribe”, they say “America”, or “white people”, or “straight white men”. That way it’s humble self-criticism. They are so interested in justice that they are willing to critique their own beloved side, much as it pains them to do so. We know they are not exaggerating, because one might exaggerate the flaws of an enemy, but that anyone would exaggerate their own flaws fails the criterion of embarrassment.\n\n&gt;&gt; The Blue Tribe always has an excuse at hand to persecute and crush any Red Tribers unfortunate enough to fall into its light-matter-universe by defining them as all-powerful domineering oppressors. They appeal to the fact that this is definitely the way it works in the Red Tribe’s dark-matter-universe, and that’s in the same country so it has to be the same community for all intents and purposes. As a result, every Blue Tribe institution is permanently licensed to take whatever emergency measures are necessary against the Red Tribe, however disturbing they might otherwise seem.\n\n&gt;&gt; And so how virtuous, how noble the Blue Tribe! Perfectly tolerant of all of the different groups that just so happen to be allied with them, never intolerant unless it happen to be against intolerance itself. Never stooping to engage in petty tribal conflict like that awful Red Tribe, but always nobly criticizing their own culture and striving to make it better!\n\n&gt;&gt; Sorry. But I hope this is at least a little convincing. The weird dynamic of outgroup-philia and ingroup-phobia isn’t anything of the sort. It’s just good old-fashioned in-group-favoritism and outgroup bashing, a little more sophisticated and a little more sneaky.","stickied":false,"gilded":0}{"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"retrieved_on":1486492071,"subreddit_id":"t5_2rd2l","link_id":"t3_5qhw5w","author":"pizzashill","score":24,"body":"Not really, people like you give the conservatards an absurd amount of ammo against us.\n\nYou laser focus on the fringe crazy nazis and try to claim that's Trump's entire base.\n\nA shit load of people got scammed by Donald Trump, they don't know any better.\n\nCalling them nazis and supporting violence against these people is absurd. The problem with the far left is they define anyone that disagrees with them as a nazi.\n\nAnd that's exactly why the calls for violence are disturbing. Because you're basically trying to ok violence against anyone that disagrees with you.\n\nAre Trump supporters stupid people on average? Of course.\n\nDoes that mean you can attack them? No.","stickied":false,"gilded":0,"subreddit":"Drama","id":"dczrmud","edited":false,"parent_id":"t1_dczrk4v","distinguished":null,"created_utc":1485550892}{"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2rd2l","retrieved_on":1486492345,"link_id":"t3_5qhw5w","author":"pizzashill","score":22,"stickied":false,"gilded":0,"body":"The subs you hang out on have labeled anyone that disagrees with them a nazi.\n\nI have literally been called a nazi and a stormfront recruiter over 20 times and my entire comment history is full of anti-Trump attacks.\n\nYou guys are every bit as bad as Trumptards are.","subreddit":"Drama","parent_id":"t1_dczry2u","id":"dczs79y","edited":false,"created_utc":1485551553,"distinguished":null}{"created_utc":1485553308,"distinguished":null,"parent_id":"t1_dczter9","id":"dcztozh","edited":false,"subreddit":"Drama","stickied":false,"gilded":0,"body":"It says I like to laugh at morons like you.","score":26,"author":"pizzashill","link_id":"t3_5qhw5w","subreddit_id":"t5_2rd2l","retrieved_on":1486493065,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0}{"subreddit_id":"t5_2rd2l","retrieved_on":1486505295,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5qhw5w","score":1,"author":"pizzashill","subreddit":"Drama","body":"You seem to misunderstand me.\n\nHe's doing what he said he would, the scam is what he claimed these things would do.\n\nHis base was dumb enough to think Trump understood basic economics.","stickied":false,"gilded":0,"id":"dd0isn3","edited":false,"parent_id":"t1_dd03c44","distinguished":null,"created_utc":1485598868}{"id":"dd0jsj4","edited":false,"parent_id":"t1_dd0jouf","distinguished":null,"created_utc":1485602426,"link_id":"t3_5qhw5w","retrieved_on":1486505775,"subreddit_id":"t5_2rd2l","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"Drama","stickied":false,"gilded":0,"body":"How on earth is it working?\n\nCan you point out a single policy Trump ran on supported by empirical data?","score":1,"author":"pizzashill"}{"created_utc":1485621516,"distinguished":null,"parent_id":"t1_dd0my1r","edited":false,"id":"dd0siyk","stickied":false,"body":"Give me an example.","gilded":0,"subreddit":"Drama","author":"pizzashill","score":1,"link_id":"t3_5qhw5w","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2rd2l","retrieved_on":1486509992}{"link_id":"t3_5qhw5w","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"retrieved_on":1486510470,"subreddit_id":"t5_2rd2l","gilded":0,"stickied":false,"body":"https://www.psychiatry.org/patients-families/schizophrenia","subreddit":"Drama","author":"pizzashill","score":1,"parent_id":"t1_dd0te2q","id":"dd0tilq","edited":false,"created_utc":1485622928,"distinguished":null}{"author":"pizzashill","score":24,"gilded":0,"stickied":false,"body":"You realize the US doesn't owe China that much money, right?\n\nThey also never paid those bonds back, they owe US investors billions.\n\nhttp://americanbondholdersfoundation.com/","subreddit":"news","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh3l","retrieved_on":1486541298,"link_id":"t3_5qw51o","distinguished":null,"created_utc":1485727190,"id":"dd2locp","edited":false,"parent_id":"t1_dd2leow"}{"created_utc":1485730827,"distinguished":null,"parent_id":"t1_dd2mf4l","id":"dd2oit1","edited":false,"subreddit":"news","stickied":false,"gilded":0,"body":"Lol, you don't seem to understand how a war like this would work.\n\nIt'd be a conventional war in a region. You wouldn't see invasions of China or the US.\n\nYou're seriously underestimating Chinese naval ability. There would be serious losses on both sides.","score":42,"author":"pizzashill","link_id":"t3_5qw51o","subreddit_id":"t5_2qh3l","retrieved_on":1486542663,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null}{"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486542773,"link_id":"t3_5qw51o","author":"pizzashill","score":46,"stickied":false,"body":"Yeah, it's no contest if you don't understand modern naval combat.\n\nChina has a fairly advanced local navy and a lot of area denial anti-ship missiles.\n\nI promise you right now, if you think the US would just roll over China you are living in a fantasy land.\n\nhttps://news.usni.org/wp-content/uploads/2015/12/RL33153_6.pdf\n\nLosing a single carrier over there would mean the US loses about 35% of it's naval power in the area.\n\n&gt;&gt; Most observers believe that, consistent with these goals, China wants its military to be capable of\nacting as an anti-access/area-denial (A2/AD) force—a force that can deter U.S. intervention in a\nconflict in China’s near-seas region over Taiwan or some other issue, or failing that, delay the\narrival or reduce the effectiveness of intervening U.S. forces.31 (A2/AD is a term used by U.S.\nand other Western writers. During the Cold War, U.S. writers used the term sea-denial force to\nrefer to a maritime A2/AD force.) ASBMs, ASCMs, attack submarines, and supporting C4ISR\nsystems are viewed as key elements of China’s emerging maritime A2/AD force, though other\nforce elements are also of significance in that regard.\n\n&gt;&gt; China’s maritime A2/AD force can be viewed as broadly analogous to the sea-denial force that\nthe Soviet Union developed during the Cold War with the aim of denying U.S. use of the sea and\ncountering U.S. naval forces participating in a NATO-Warsaw Pact conflict. One difference\nbetween the Soviet sea-denial force and China’s  emerging maritime A2/AD force is that China’s\nforce includes ASBMs capable of hitting moving ships at sea.\n\n","gilded":0,"subreddit":"news","parent_id":"t1_dd2ooea","id":"dd2or3l","edited":1485731511,"created_utc":1485731124,"distinguished":null}{"parent_id":"t1_dd2psg8","id":"dd2pw1s","edited":false,"created_utc":1485732575,"distinguished":null,"link_id":"t3_5qw51o","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"retrieved_on":1486543319,"subreddit_id":"t5_2qh3l","stickied":false,"gilded":0,"body":" Not all carriers are deployed at once. \n\nI said \"in the area.\" \n","subreddit":"news","author":"pizzashill","score":19}{"link_id":"t3_5qw51o","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486543330,"stickied":false,"body":"I actually linked a report from the US navy supporting my arguments.\n\nBut nice try. \n\n","gilded":0,"subreddit":"news","author":"pizzashill","score":41,"parent_id":"t1_dd2pu7f","edited":false,"id":"dd2pwuz","created_utc":1485732603,"distinguished":null}{"parent_id":"t1_dd2q7z2","edited":false,"id":"dd2qcy1","created_utc":1485733175,"distinguished":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486543543,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5qw51o","score":33,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"&gt;&gt; You linked to an opinion piece/theory/argument\n\nNo, I linked you a report from the US navy.\n\n&gt;&gt; and they are responding to another paper written by two other \"defense scholars\" as they put it with pretty much two separate conclusions.\n\nThis is just blatantly false. You either didn't read what I linked, or you're trolling.\n\n&gt;&gt; So yes, armchair admiral.\n\nAgain, I supported my argument with actual expert opinion and facts from the navy.\n\nYou can keep trying to deny reality, but you're just embarrassing yourself.\n\nI'll just call you out now to complete the embarrassment though.\n\nCan you point out what I said that is factually incorrect?\n"}{"created_utc":1485733486,"distinguished":null,"parent_id":"t1_dd2qfne","id":"dd2qlvm","edited":false,"score":17,"author":"pizzashill","subreddit":"news","stickied":false,"gilded":0,"body":"&gt;&gt; That's what armchair admirals do. Swap reports from other places and argue about them from the comfort of their chair.\n\nYes, also known as using experts and facts to support arguments. \n\n&gt;&gt; This leads to a lot of oversights. For instance, in case of absolute war, China's force as of this report would still be woefully insufficient, and said document addresses China's naval scope. Further, all of the above neglects the importance of varying approaches. There are a lot of routes to take to eliminate defensive naval forces in the area before moving in.\n\nYou need to not discuss subjects you aren't educated on, or at the very least, work on your reading ability, it's sub-par.\n\nI said the losses would be great on both sides, not that the US navy would lose currently. My argument is against uneducated people (you) claiming it would be one sided and the US would roll over them.\n\nThat's a fantasy. You aren't smart enough to discuss this, I suggest you walk away.","subreddit_id":"t5_2qh3l","retrieved_on":1486543662,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"link_id":"t3_5qw51o"}{"id":"dd2qsn2","edited":false,"parent_id":"t1_dd2qpwr","distinguished":null,"created_utc":1485733726,"subreddit_id":"t5_2qh3l","retrieved_on":1486543753,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"link_id":"t3_5qw51o","score":8,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"Your arguments make no sense. You're just throwing out buzzwords over and over again and clearly don't understand the subject.\n\nYou should learn what A2/AD  is."}{"created_utc":1485733928,"distinguished":null,"parent_id":"t1_dd2qwoa","edited":false,"id":"dd2qydb","stickied":false,"gilded":0,"body":"No, I did not, that is a blatant lie.\n\n\n\nThe same exact source is in that comment.","subreddit":"news","author":"pizzashill","score":11,"link_id":"t3_5qw51o","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486543829}{"score":5,"author":"pizzashill","subreddit":"news","gilded":0,"stickied":false,"body":"No I did not, that is a blatant god damn lie.\n\nhttps://np.reddit.com/r/news/comments/5qw51o/uschina_war_increasingly_a_reality_chinese_army/dd2or3l/\n\nThe same exact source has been there the entire time. ","subreddit_id":"t5_2qh3l","retrieved_on":1486543865,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5qw51o","created_utc":1485734019,"distinguished":null,"parent_id":"t1_dd2qzda","id":"dd2r13r","edited":false}{"retrieved_on":1486543918,"subreddit_id":"t5_2qh3l","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5qw51o","score":4,"author":"pizzashill","subreddit":"news","body":"I'm not so sure about this.\n\nIt wouldn't be easy, but the US would win, the losses would just be staggering.","stickied":false,"gilded":0,"parent_id":"t1_dd2r3xz","edited":false,"id":"dd2r534","created_utc":1485734158,"distinguished":null}{"link_id":"t3_5qw51o","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486543965,"stickied":false,"gilded":0,"body":"No, you're thinking about my second comment, which included a report on area denial. I took it out because it wasn't relevant yet.\n\nThat being said, the people that authored that report?\n\nhttp://www.fpri.org/contributor/frank-hoffman/\n\n&gt;&gt; **Effective June 20, 2011, Mr. Hoffman is serving at the National Defense University as a Distinguished Research Fellow with the Institute for National Strategic Studies. He formerly directed the NDU Press operations which includes the journals Joint Force Quarterly and PRISM. From August of 2009 to June 2011, he served in the Department of the Navy as a senior executive as the Senior Director, Naval Capabilities and Readiness.**\n\nThe second report I linked is credible.","subreddit":"news","author":"pizzashill","score":11,"edited":false,"id":"dd2r8n9","parent_id":"t1_dd2r5nx","distinguished":null,"created_utc":1485734285}{"created_utc":1485734752,"distinguished":null,"parent_id":"t1_dd2rh03","edited":false,"id":"dd2rlde","subreddit":"news","gilded":0,"stickied":false,"body":"My first link was always the navy report.\n\nThe second one though, is very credible. The guy is an expert from the department of navy. He's talking about how people underestimate their area denial ability, it's all well sourced and informative.\n\nAnd that's my point - the US might win, but the losses would be staggering. It wouldn't be a face roll which seems to be the opinion being thrown around here.\n","score":10,"author":"pizzashill","link_id":"t3_5qw51o","retrieved_on":1486544135,"subreddit_id":"t5_2qh3l","author_flair_css_class":null,"author_flair_text":null,"controversiality":0}{"created_utc":1485795811,"distinguished":null,"parent_id":"t1_dd3rcvj","edited":false,"id":"dd3rhly","subreddit":"news","body":"Any war between the US and China would not go nuclear. It'd be a conventional regional war with no land invasions.\n\n","stickied":false,"gilded":0,"score":3,"author":"pizzashill","link_id":"t3_5qw51o","subreddit_id":"t5_2qh3l","retrieved_on":1486561386,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0}{"distinguished":null,"created_utc":1485797244,"id":"dd3sqjg","edited":false,"parent_id":"t1_dd3sgjd","subreddit":"news","gilded":0,"stickied":false,"body":"This seems... Questionable.\n\nhttp://www.china-food-security.org/concl/con_1.htm\n\nChina has the ability to feed themselves. \n\nAs for your nuke argument, I'd argue if we hit the Chinese mainland in an attempt to starve them, it very likely would become a nuclear conflict.\n\n","score":1,"author":"pizzashill","link_id":"t3_5qw51o","subreddit_id":"t5_2qh3l","retrieved_on":1486561991,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null}{"gilded":0,"stickied":false,"body":"&gt;&gt; No need to use nukes on their cities, I wouldn't advise it at least.\n\nI'm not talking about nukes. Even conventional strikes would cause problems.\n\n\n&gt;&gt; As for feeding themselves, that study is referencing their future capacity to produce enough food, as opposed to their current capacity, which is limited by the availability and quality of land and water.\n\nI think you aren't considering that a country given a reason can mobilize pretty quickly. The Japanese thought they could deal a decisive blow against the US by destroying our navy at pearl harbor. And we all know how that went. \n\nAnother part of this is that China actually **exports** food. \n\nhttps://en.wikipedia.org/wiki/Agriculture_in_China\n\nI don't think attacking ports would starve them really. I also think it'd be hard to just destroy every port they have. \n\nThe Chinese have s-300s for example, which are capable defenses against the type of missiles that would be used on ports.\n\n\n","subreddit":"news","author":"pizzashill","score":1,"link_id":"t3_5qw51o","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2qh3l","retrieved_on":1486562455,"created_utc":1485798317,"distinguished":null,"parent_id":"t1_dd3tc2g","id":"dd3tpf9","edited":false}{"author":"pizzashill","score":-42,"body":"Holy shit, it was clearly hyperbole you delusional tard. \n\nIf rural Americans want to trash the country and do damage to themselves then so be it. I'll be fine. I said I'd personally vote for it, not that it should happen.\n\nI don't even think they're fascists, just dumb people.","stickied":false,"gilded":0,"subreddit":"ShitPoliticsSays","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"subreddit_id":"t5_2vcl0","retrieved_on":1486564209,"link_id":"t3_5r1vi7","created_utc":1485802356,"distinguished":null,"parent_id":"t1_dd3x1u9","id":"dd3xcw2","edited":false}{"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486564258,"subreddit_id":"t5_2vcl0","link_id":"t3_5r12p0","author":"pizzashill","score":-8,"body":"https://www.youtube.com/watch?v=cAvq12Sa3VE","stickied":false,"gilded":0,"subreddit":"ShitPoliticsSays","id":"dd3xgla","edited":false,"parent_id":"t1_dd3kss8","distinguished":null,"created_utc":1485802469}{"id":"dd3y6mt","edited":false,"parent_id":"t1_dd3xxr3","distinguished":null,"created_utc":1485803300,"link_id":"t3_5r1vi7","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2vcl0","retrieved_on":1486564605,"stickied":false,"body":"I'm not a \"progressive\" so you can stop the disingenuous Trumptard shit right now.\n\nThe progressive wing of the DNC is every bit as retarded as the Trumptard wing of the republican party.","gilded":0,"subreddit":"ShitPoliticsSays","author":"pizzashill","score":-7}{"parent_id":"t1_dd3xwyu","id":"dd3y8be","edited":false,"created_utc":1485803354,"distinguished":null,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"retrieved_on":1486564628,"subreddit_id":"t5_2vcl0","link_id":"t3_5r1vi7","author":"pizzashill","score":-33,"stickied":false,"gilded":0,"body":"Are you trying to claim someone living in rural America is the same as a race?\n\nReally? Do you have any idea how bat-shit insane this is? Rural Americans are dumb people, they aren't an ethnic group.","subreddit":"ShitPoliticsSays"}{"distinguished":null,"created_utc":1485804194,"id":"dd3yywz","edited":false,"parent_id":"t1_dd3yrhs","score":-12,"author":"pizzashill","subreddit":"ShitPoliticsSays","gilded":0,"stickied":false,"body":" I linked one example.\n\nFox news was on an 8 year crusade against Obama. Do you even remember the last 8 years?\n\nHe got attacked for putting on a fucking tan suit and mom jeans.\n\n\nSeriously, go on fox news and search \"Obama\" and look at the crazy. And unlike Trump, Obama wasn't a mentally disabled orange con artist.\n\nLet me help you out.\n\n\nhttps://en.wikipedia.org/wiki/Hostile_media_effect","subreddit_id":"t5_2vcl0","retrieved_on":1486564983,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"link_id":"t3_5r12p0"}{"created_utc":1485805371,"distinguished":null,"parent_id":"t1_dd3zxt1","edited":false,"id":"dd401fv","subreddit":"ShitPoliticsSays","stickied":false,"gilded":0,"body":"I don't know, I didn't vote for someone that thinks vaccines cause autism and climate change is a hoax.","score":-22,"author":"pizzashill","link_id":"t3_5r1vi7","retrieved_on":1486565496,"subreddit_id":"t5_2vcl0","author_flair_css_class":null,"author_flair_text":null,"controversiality":0}{"author":"pizzashill","score":-11,"gilded":0,"stickied":false,"body":"&gt;&gt; Trump has been President for a week and look at how much the media has attacked him and will probably continue to do so. Look at all the protests from the mentally stunted left and how they absolutely champion anything anti-Trump. Trump took more shit from the media on his campaign trail than Obama took during his entire 2 terms in office, and Obama killed people!\n\nYou need to listen to me. Fox news was after Obama from **day 1.** The absurd shit they spammed about him was just out of control.\n\n&gt;&gt; No, he was just a man who bombed innocent civilians while the left swooned and cried and thanked him for his service as he left office. And the media largely let him get away with it.\n\nTrump is bombing civilians, what's your point exactly? What is it Obama got away with? Maintaining the war against ISIS?\n\nShould we have just not bombed ISIS? I thought we needed to defeat them, how are we going to defeat them without bombs?\n\n\nLike do you have any idea how horrible your logic is?\n\nThe right has been spamming that Obama was friendly with Islamic terrorists for 8 years, but he's also bad because he was bombing Islamic terrorists?\n\nYou can't have it both ways, you can't believe we need to wipe ISIS out, and then attack Obama for bombing them because some civilians were killed as well.\n\nDo you think it's possible to bomb a country without civilian casualties? Hell, Trump's first raid killed civilians.\n\nhttp://www.independent.co.uk/news/world/middle-east/donald-trump-us-military-attack-yemen-civilians-women-children-dead-a7553121.html\n\n&gt;&gt; The eight-year-old daughter of a radical preacher was among a large group of civilians reportedly killed during a US dawn raid in Yemen, the first military operation overseen by Donald Trump. \n\n&gt;&gt; Around 30 people, including 10 women and children, are thought to have been killed by American military personnel in the rural Yakla district of al-Bayda in the south of the country, according to medical staff.\n\n","subreddit":"ShitPoliticsSays","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2vcl0","retrieved_on":1486565756,"link_id":"t3_5r12p0","distinguished":null,"created_utc":1485805971,"edited":false,"id":"dd40kzw","parent_id":"t1_dd3zw93"}{"created_utc":1485806674,"distinguished":null,"parent_id":"t1_dd414u9","edited":false,"id":"dd417r6","author":"pizzashill","score":-8,"stickied":false,"gilded":0,"body":"They elected someone that has gone on the Alex Jones show.\n\nThinks vaccines cause autism.\n\nThinks climate change is a hoax.\n\nAnd ran on a platform of pure economic illiteracy. If these people aren't dumb, what is it they are?\n\nhttp://fivethirtyeight.com/features/education-not-income-predicted-who-would-vote-for-trump/\n\n","subreddit":"ShitPoliticsSays","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"retrieved_on":1486566059,"subreddit_id":"t5_2vcl0","link_id":"t3_5r1vi7"}{"distinguished":null,"created_utc":1485807271,"edited":false,"id":"dd41r4z","parent_id":"t1_dd416ky","subreddit":"ShitPoliticsSays","stickied":false,"gilded":0,"body":"Jesus, the historic illiteracy here.\n\n&gt;&gt; Obama chose to go into Syria \n\nNo, Obama had to go into Syria because after the civil war broke out ISIS went over the Iraqi border and used the civil war as a way to recruit. \n\nThat group you see today? ISIS? It's been around since the 1990s. It's the group the US military routed during the invasion.\n\nThey basically fled to the border and sat there, then civil war broke out in Syria and they went into the country and managed to grow pretty large.\n\n\nThat's why the US went into Syria.\n\n&gt;&gt; Yemen\n\nAnd again, you ignore all history.\n\nhttps://en.wikipedia.org/wiki/Yemeni_Civil_War_(2015%E2%80%93present)\n\nA revolutionary group supported by Iran was taking over Yemen. \n\nThis was again, the US intervening in a civil war at the request of the Yemen government.\n\n\n&gt;&gt; He was a hawkish politician that furthered the Bush agenda and Hillary would have been more of the same.\n\nLol? Trump is literally continuing the Bush agenda. \n\n\n&gt;&gt; Trump now is dealing with the mess Bush, Obama and Hillary created\n\nI see, so when Obama goes to war in countries destabilized by Bush, that's Obamas fault, but when Trump does it, he's just cleaning up a mess.\n\nCan't argue with that perfect logic.\n\n\n&gt;&gt;  and you are trying to create the false comparison that Trump is the one that wants to start new wars.\n\nTrump is fucking sabre rattling China and Iran and has literally said he would shoot Iranian boats in international waters. \n\nhttp://www.businessinsider.com/chinese-military-official-war-2017-1\n\n\n&gt;&gt; Trump wants to finish the monster that Obama and Hillary created in Syria and then leave. Like... do you hear me? Like.\n\nI hear you alright, you're just delusional and seem to not know anything about any of the wars we've involved in.\n\nNot only that, Trump actually begged the government to invade Libya.\n\nhttps://www.youtube.com/watch?v=zuvZQMY9WNw","score":-8,"author":"pizzashill","link_id":"t3_5r12p0","retrieved_on":1486566317,"subreddit_id":"t5_2vcl0","author_flair_css_class":null,"controversiality":0,"author_flair_text":null}{"edited":false,"id":"dd42ass","parent_id":"t1_dd419tf","distinguished":null,"created_utc":1485807877,"retrieved_on":1486566579,"subreddit_id":"t5_2vcl0","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5r1vi7","score":-12,"author":"pizzashill","subreddit":"ShitPoliticsSays","gilded":0,"stickied":false,"body":"Because I'm not attacking an ethnic group, I'm attacking a region with an awful culture that votes to fuck this country over every 4 years.\n\nYour victimhood mentality where you think rural tards are some protected class on equal footing with race isn't going to fly here. \n\nNot even all rural Americans are dumb, just the ones that got scammed by Trump.\n\nI also didn't call them inferior, I called them stupid. You guys are an embarrassment, your disingenuous comparisons to racism  make me physically cringe.\n\n&gt;&gt; race is an arbitrarily defined social group.\n\nOh, fucking please. When racist people talk about race this isn't what they mean and you know it.\n\nThis is just absurd gymnastics. It's like when fat activists try to compare themselves to racial groups.\n\nIn fact, word for word, I've seen this same argument you just used thrown out by fat activists.\n\nHating someone for their race is you hating someone for something that's out of their control. \n\nHating rural people for voting Trump? That's a choice they made, it's a valid attack. Voting is a choice, race isn't.\n\nIf rural people were forced to vote Trump, and I attacked them, then you would have a valid point. "}{"parent_id":"t1_dd42t4y","edited":false,"id":"dd435nh","created_utc":1485808822,"distinguished":null,"link_id":"t3_5r1vi7","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2vcl0","retrieved_on":1486566991,"stickied":false,"gilded":0,"body":"&gt;&gt; Yes you are, dipshit:\n\nNo I'm not, dipshit. I'm using \"ethnic\" in the context of race. It can be used both ways.\n\n&gt;&gt; Please logically explain why hating people based on location is somehow better than hating people based on race. There is no logical distinction that justifies your hate. Hate is hate.\n\n**I don't hate them because they live in rural America, I hate them for being dumb enough to elect Trump, that is a choice they made, had the cities elected him I'd feel the same exact way.**\n\n&gt;&gt; Again, since you have failed to logically differentiate between race and location demographic, what you said is on par with \"Most Blacks are stupid.\"\n\nNo, it is not.\n\nVoting is a choice, race is not a choice. You have serious cognitive problems.\n\n&gt;&gt; Waiting for an argument. Appeal to common knowledge is not an argument.\n\nThat wasn't even an argument you moron, I was stating a fact.\n\n\n&gt;&gt; \"Hating blacks for voting Trump? It's a valid attack.\" /hypothetical. Would hating blacks be justified if they proportionally voted Trump?\n\n**Race is not a choice, a vote is.** \n\nIf black people as a demographic elected Trump, I'd be calling them dumb too. But I wouldn't be calling them dumb for being black, I'd be calling them dumb because they voted Trump.\n\nTheir race has nothing to do with it. Like I said, you have severe cognitive problems. Your logic reminds me of speaking to a child.\n\nYou're basically trying to play identity politics. You see this with SJWs a lot.\n\nA black guy will do something stupid, someone will call it stupid, and the SJW will declare you racist for calling him stupid, assuming the reason you're calling him stupid is his race rather than the action.\n\n\n\n","subreddit":"ShitPoliticsSays","author":"pizzashill","score":-4}{"stickied":false,"body":"&gt;&gt; Changes definition to fit his fragile worldview. Not an argument.\n\nNo, uses the word correctly.\n\nhttps://en.wikipedia.org/wiki/Ethnic_group\n\n&gt;&gt; Ethno-racial, emphasizing shared physical appearance based on genetic origins — example: African Americans\n\nI used it in a racial context.\n\n&gt;&gt; You said \"all rural americans.\" when you initially talked about restricting votes. You're just moving the goalposts. This would mean even rural Americans that did not vote Trump also get their rights taken away.\n\nWe've gone over this multiple times. I didn't say I wanted it to happen, just that I'd vote yes, and it was more of a joke than anything else. \n\n\n&gt;&gt; You don't get to just say \"nuh uh\" without proving it. Prove that hating race is worse than hating demographics. Prove it.\n\nUh, you're the one making the claim it is, the burden is on you. I've already told you why your argument makes no sense.\n\nRace is a choice.\n\nA vote isn't.\n\n\n&gt;&gt; \"I hate people who do not assume my completely subjective worldview. I'm too ignorant to understand that many others have different views and that many of them did not want Clinton in office.\"\n\n\nYou seem to be confused here. I don't hate rural Americans for anything related to a subjective view.\n\nI hate them because the facts line up against them. Tons of smart people disagree with my subjective worldviews, I don't hate those people.\n\nI can support the fact nothing Trump ran on was supported by empirical data. This isn't a \"subjective view.\"\n\n&gt;&gt; No, it wasn't. \"AND YOU KNOW IT!!!!1\" is never a proof.\n\n\n\nWhen racists talk about race are they talking about biological race or cultural race?\n\n\n\n\n&gt;&gt; Pretending that this matters. You are fragile enough that you justify your hate because someone imposed their will on you through voting while you did the same exact thing.\n\nIt does matter, hating people for dumb choices they make is fine, hating people for things out of their control is NOT fine. \n\nI also like how you keep calling me fragile, while you play SJW identity politics.\n\n\n\n&gt;&gt; \"Those dumb blacks have a higher single-motherhood rate than any other race.\" This statement is just fine according to your logic. After all, blacks are only dumb if they made a bad choice!\n\n\nExcept that isn't because of choices being made. A single mother could easily end up in that spot because her partner is killed, or he's in jail, with nothing to do with her.\n\nAgain, your arguments make no rational sense. Hating people for making dumb choices does not = hating people for things out of their control.\n\nOn top of this, you could argue black people aren't having a hard time because of factors in their control, racism was a real problem in this country for hundreds of years.\n\n\n&gt;&gt; Lol, you have no logic at all here. Quite hilarious, actually. Is your worldview so fragile that anyone who opposes Dear Leader Clinton is to be hated and shamed?\n\nKeep trying to strawman me.\n\nI don't even like Clinton, she's a piece of shit, she's still better than Trump. I don't live in a nirvana fallacy, my retarded friend.\n\n&gt;&gt; Don't forget that many of Trumps supporters simply didn't want someone who advocated for strict gun laws, subsidized tuition, less restriction on baby killing, and broke federal law. \n\nA) Yeah, because as we all know, gun rights have been taken away in these last 8 years, said nobody ever.\n\nB)  it is an objective fact that subsidized tuition is a benefit to our country.\n\nC) It isn't baby killing, it's called having control over your own body.\n\nD) Can you point out which federal law Hillary Clinton broke?\n\n\n&gt;&gt; Trump was a lesser evil to those people. Next, you'll say that all people who oppose those are also to be hated.\n\nHe was the lesser evil to people with poor critical thinking ability. Because there sure as hell isn't a rational way to think that.\n\n&gt;&gt; I never said that I hated a specific group of people, nor do I advocate for taking voting rights away from people who... voted. You're a statist scum of a human being.\n\nKeep playing those SJW identity politics you pathetic cuck.\n\n&gt;&gt; If this is really your view, then why did you say \"rural Americans\" instead of \"Trump voters.\" The contradiction in your statements is absolutely astounding.\n\nBecause rural America overwhelmingly went for Trump. And as already said, I wasn't being serious you delusional tard.\n\nKeep up the SJW dogma dude, it's hilarious.\n\n","gilded":0,"subreddit":"ShitPoliticsSays","author":"pizzashill","score":0,"link_id":"t3_5r1vi7","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486567680,"subreddit_id":"t5_2vcl0","created_utc":1485810406,"distinguished":null,"parent_id":"t1_dd43zpb","edited":1485810998,"id":"dd44l6k"}{"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2vcl0","retrieved_on":1486568676,"link_id":"t3_5r1vi7","author":"pizzashill","score":0,"stickied":false,"body":"&gt;&gt; No, you didn't. The word \"ethnic group\" means all ethnic groups. Ethno-racial groups is a sub-sect.\n\nNo, it does not, and I just linked you something saying that. \n\n&gt;&gt; **Depending on which source of group identity is emphasized to define membership, the following types of (often mutually overlapping) groups can be identified:**\n\nYou are wrong and will remain wrong.\n\n&gt;&gt; \"I was only pretending to be retarded.\"\n\nUh, I was joking, again. Also, there's nothing really retarded about hating dumb people.\n\n&gt;&gt; And I did. Hating someone for an arbitrary quality they cannot control is seen as immoral. Rural Americans cannot control that they are rural americans. Asians cannot control that they are asian. Since the main argument against racism is that being black does not make someone evil, that would also mean that hating someone because they are Asian, white, blue-eyed, etc is just as evil.\n\nAgain.\n\n**I have already said, I do not hate them for being in rural america, I hate them for the way they voted.**\n\nThe fact you can't follow this is just cringe. \n\n\n&gt;&gt; So, to be clear, those who voted Trump because they didn't want to risk stricter gun laws or lesser abortion restrictions are to be hated? You did say \"Trump voters,\" so don't move the goalposts on me again.\n\nDude, these people are retarded. Every election cycle the NRA claims people are coming after their guns.\n\n**It never fucking happens.** It's literally a scheme to sell more guns. Record number of guns sold under Obama.\n\nAs for the abortion shit, yes they are to be hated. They are trying to force their personal views on other people and tell other people what they can and can't do with their bodies.\n\nThey are wrong.\n\n\n&gt;&gt; I do not know until I talk to them personally. Some racists point to biological differences to attempt to prove inferiority. Others point to their culture. It differs from racist to racist.\n\nThis is bullshit, every racist group in the country is based on biological racism.\n\n\n\n&gt;&gt; If you want to embrace this view then fine. But it, by definition, makes you a hateful person. I don't hate anyone. I debate them and attempt to gain an understanding - and an upper hand - on their hateful ideologies.\n\nCool, I'll keep hating them. \n\n\n&gt;&gt; The prompt you provided was catering to the idea of \"identity politics.\" You began by separating the american public into a group and hating them.\n\nNot based on their identity, based on the choices they made. Nice try.\n\n&gt;&gt; My point is that even IF it was a choice, this statement would be unwarranted.\n\nThe only reason your wording makes it racist is because you're using race, when socioeconomic factors play a larger role.\n\nThat's my point.\n\n&gt;&gt; And again, you said you'd vote to remove votes from rural America. That's what this entire argument is about. Also, taking away rights from people you hate is not at all justified.\n\n**Was clearly a joke.**\n\nThis sub is like the right wing SRS.\n\n\n&gt;&gt; That isn't a strawman. By definition, Trump supporters oppose Clinton. Those who opposed her enough to bite the bullet for Trump are on your hate list.\n\nIt was blatantly a strawman. \n\n\n&gt;&gt; As a pro-lifer who advocates for individual human freedom over government intervention, I vehemently disagree.\n\n- Anti-choice\n\n- Values individual freedom.\n\n- Wants to take rights from people.\n\n\n&gt;&gt; 2) I don't care if it benefits anyone. It is no one's responsibility but the student to pay for their loans. I don't believe in state-sponsored charity. It's a direct infringement of property rights to force someone to give their capital to something I do not want to give it to.\n\nThat's awesome, in the rational world we're interested in improving society. Education improves society, access to education improves society.\n\nPS: You have no right to your pretax income, so your argument makes no sense. \n\n\n&gt;&gt; There is zero logical or scientific differentiation between a fetus and a person with rights.\n\nOne is a lump of cells, one is a person. By your logic, there's nothing different between a tumor and a person with rights. \n\n\n&gt;&gt; An organism is declared dead when they have no cellular processes and they have no internal homeostasis. This is when rights are revoked. The logical contrapositive states that all beings with cellular reproduction and homeostasis are given rights. This means fetsus's as well. What scientifically separates a fetus from a human person that makes the fetus's rights null and void?\n\nThe fact a fetus is not a person, it is a lump of cells, a parasite. It has no rights because it is not a person on any level, it's a potential person. I'm not itnerested in debating someone that thinks their religious fairy tale has a right to control other peoples bodies.\n\n\n\n&gt;&gt; 4) The one where mishandling classified information is punishable with fines or jail time. And don't give me this \"BUT THE FBI SAID...\" because the government does not determine guilt. Action does. Just because the government said someone didn't do something doesn't make it true.\n\n\nYeah, you're dumb.\n\nhttps://warontherocks.com/2016/07/why-intent-not-gross-negligence-is-the-standard-in-clinton-case/\n\nMishandling classified information via negligence is not actually a civilian criminal offense. I'll tell you what, go find me a single civilian ever charged with 793f using a negilegence theory.\n\nAlso, what the fuck? You said she broke federal law, the government decides federal law. \n\n&gt;&gt; Of course, an unprovable statement to single out another voting bloc.\n\nThe man speaks at a 3rd grade level and has gone on the Alex Jones show.\n\nHe's displayed he has no idea what he's talking about on even a basic level.\n\nHe's spewing economic illiteracy and attacking our allies. In what universe does this person have any business in the white house?\n\n\n&gt;&gt; Then why are you disputing it? Just admit it was a stupid statement and we can be done here.\n\nI'm not disputing the statement. I'm disputing these garbage arguments in relation to race and nothing else.\n\nLike I said, this sub is just the right wing SRS.\n","gilded":0,"subreddit":"ShitPoliticsSays","id":"dd46niw","edited":1485813154,"parent_id":"t1_dd45umi","distinguished":null,"created_utc":1485812742}{"parent_id":"t1_dd4844t","edited":false,"id":"dd48kbh","created_utc":1485814936,"distinguished":null,"link_id":"t3_5r1vi7","author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2vcl0","retrieved_on":1486569590,"body":"M8, I don't give a shit about the left.\n\nI'd rather be right than coddle these people. Honestly, they vote for people that want to discriminate and take our civil rights every cycle.\n\nSo you know what? I'm going to attack them for that.\n","stickied":false,"gilded":0,"subreddit":"ShitPoliticsSays","author":"pizzashill","score":1}{"retrieved_on":1486570068,"subreddit_id":"t5_2vcl0","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5r1vi7","score":0,"author":"pizzashill","subreddit":"ShitPoliticsSays","gilded":0,"stickied":false,"body":"&gt;&gt; Literally says \"types of groups\" in an article about ethnic groups. How it can be any more obvious I don't know.\n\nI'm starting to suspect you're functionally disabled. Like my god, you can use ethnic in a racial context and a cultural context.\n\n&gt;&gt; PICK ONE. Not all rural people voted for Trump. So your statement is false.\n\nI hate Trump voting rural people, or 90% of rural people.\n\n&gt;&gt; Why do I have to give a shit about society? I care about me, my family, and friends. I don't care about anyone elses' education. I am not responsible for that at all. Why should I be required to pay for it? You just hate freedom.\n\nNo, I just enjoy a functioning society. And society disagrees with you.\n\nBut hey, you're more than free to move up into the mountains and you won't be locked down anymore.\n\nNobody is keeping you in society. You stay because you enjoy the comfort of society.\n\n&gt;&gt; You are a lump of cells. How do you measure personhood and how can you attribute it to all human organisms... except for a fetus? It's arbitrary, unscientific, and illogical.\n\n\nThere's a difference between a lump of cells and a person. I'm not interested in having this debate with you.\n\nPro-lifers are the 9/11 truthers of the tard world and I'm not going to sit here and try to convince you that a lump of cells is different than a person.\n\n&gt;&gt; Then what is a person, and what isn't? What scientific law or authority do you claim \"personhood\" be measured and catelogued? At what point is \"\"\"\"personhood\"\"\"\" achieved and why? I didn't bring religion into this at all. This is a purely scientific, biological argument.\n\n\nNo, it's not. The authority was given by the supreme court actually, which has clearly stated a fetus is not a person.\n\nYour personal opinion is not relevant, you are not a moral authority with the right to enforce your trash views on other people.\n\nhttps://www.princeton.edu/~prolife/articles/wdhbb.html\n\nBut here you go.\n\nThe argument over when a fetus is a person is not a scientific question.\n\n&gt;&gt; I've seen this argument used a lot, and it;s faulty at best. As a matter of fact, someone within the comments section rightfully points it out:\n\nNo, he did not,  This lie over deleted emails is one of the most common.\n\nYou'll see why below.\n\n\n&gt;&gt; She violated provisions of the Federal Records Act that forbid public employees from holding or storing classified information in unauthorized places, media or networks.\n\nNo, she did not.\n\nhttp://www.npr.org/sections/itsallpolitics/2015/04/02/396823014/fact-check-hillary-clinton-those-emails-and-the-law\n\n&gt;&gt; \"A State Department spokeswoman says Hillary Clinton did not break any rules by relying solely on her personal email account. Federal law allows government officials to use personal email so long as relevant documents are preserved for history.\"\n\n\n&gt;&gt; **The law was amended in late 2014 to require that personal emails be transferred to government servers within 20 days. But that was after Clinton left office. Watchdog groups conceded that she may not have violated the text of the law, but they argue she violated the spirit of it. The Sunlight Foundation's John Wonderlich explained to Horsley:**\n\n\n\nSo right here you can see the problem.\n\n\n&gt;&gt; Even if one accepts the argument that intent is dispositive in a decision to indict, how in the world could her setting up a personal email system and then subsequently deleting 33000+ emails when the existence of that server was discovered, NOT indicate intent to evade the laws that govern information security and transparency requirements for public officials?\"\n\nOh, that's easy, you don't understand what the word intent means in relation to this law.\n\n**Intent** in relation to these laws means intended to benefit another country.\n\n\n&gt;&gt; Anyone who points to Code 783(f) completely disregards the other actions Clinton was responsible for when dealing with her server.\n\nI'm not, but the other things you've given here are not accurate. You're claiming Clinton violated a law that didn't even exist before she left office.\n\nThere's a reason the legal consensus was she couldn't be charged for months in advance, it's because nothing she did was actually illegal.\n\n\n&gt;&gt; **The bottom line is this: No one will likely ever know what was deleted from Clinton's server. Barring one of the 30,000 emails Clinton turned over to the State Department being deemed \"classified,\" it's also unlikely she will ever be found to have violated the letter of the law.**\n\n","id":"dd49k3w","edited":1485816451,"parent_id":"t1_dd48o4r","distinguished":null,"created_utc":1485816090}{"created_utc":1485824468,"distinguished":null,"parent_id":"t1_dd4gbcd","id":"dd4gdt2","edited":false,"body":"I'm sheltered because I'm stating objective facts about Donald Trump?","stickied":false,"gilded":0,"subreddit":"ShitPoliticsSays","author":"pizzashill","score":-1,"link_id":"t3_5r1vi7","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486573384,"subreddit_id":"t5_2vcl0"}{"stickied":false,"gilded":0,"body":"Can you point out which claim about Trump I made that isn't a fact?","subreddit":"ShitPoliticsSays","author":"pizzashill","score":1,"link_id":"t3_5r1vi7","controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486574227,"subreddit_id":"t5_2vcl0","created_utc":1485826665,"distinguished":null,"parent_id":"t1_dd4i3pw","edited":false,"id":"dd4i56h"}{"score":-2,"author":"pizzashill","subreddit":"ShitPoliticsSays","stickied":false,"gilded":0,"body":"I don't hate them for where they live, I hate them for the dumb choices they make.\n\nPS: Race is not a choice, voting is.","subreddit_id":"t5_2vcl0","retrieved_on":1486575124,"author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5r1vi7","distinguished":null,"created_utc":1485828990,"edited":false,"id":"dd4k06j","parent_id":"t1_dd4jy3m"}{"id":"dd4khwh","edited":false,"parent_id":"t1_dd4k1hx","distinguished":null,"created_utc":1485829607,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"subreddit_id":"t5_2vcl0","retrieved_on":1486575364,"link_id":"t3_5r1vi7","author":"pizzashill","score":0,"gilded":0,"stickied":false,"body":"You understand that I very clearly just told you I hate them for the choices they've made, not where they live, correct?\n\nI feel the same way about the moronic Trumpers in cities. ","subreddit":"ShitPoliticsSays"}{"link_id":"t3_5r1vi7","author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit_id":"t5_2vcl0","retrieved_on":1486575609,"stickied":false,"body":"You keep talking about birth place. I hate them for the voting choices they made, nothing else.\n\n","gilded":0,"subreddit":"ShitPoliticsSays","author":"pizzashill","score":0,"parent_id":"t1_dd4kw6t","edited":false,"id":"dd4l0cp","created_utc":1485830226,"distinguished":null}{"subreddit":"ShitPoliticsSays","stickied":false,"body":"&gt;&gt; tl;dr- rural states beat you in all 3.\n\nLiterally retarded.\n\nhttps://www.nytimes.com/2016/07/31/opinion/campaign-stops/the-path-to-prosperity-is-blue.html\n\nhttps://www.brookings.edu/blog/the-avenue/2016/11/29/another-clinton-trump-divide-high-output-america-vs-low-output-america/\n\nhttp://fivethirtyeight.com/features/education-not-income-predicted-who-would-vote-for-trump/\n\nhttps://nces.ed.gov/pubs2007/2007040.pdf\n\nLiterally an education crisis in rural America.","gilded":0,"score":0,"author":"pizzashill","link_id":"t3_5r1vi7","subreddit_id":"t5_2vcl0","retrieved_on":1486589587,"controversiality":0,"author_flair_css_class":null,"author_flair_text":null,"distinguished":null,"created_utc":1485881136,"edited":1485881884,"id":"dd5dtk8","parent_id":"t1_dd4txwl"}{"score":15,"author":"pizzashill","subreddit":"worldnews","gilded":0,"stickied":false,"body":"You realize that republicans have called democrats the same thing for years, correct?\n\nhttps://www.google.com/search?espv=2&amp;rlz=1C1CHMO_enUS570US570&amp;biw=1600&amp;bih=882&amp;tbm=isch&amp;sa=1&amp;q=Hillary+is+Hitler&amp;oq=Hillary+is+Hitler&amp;gs_l=img.3...10871.12676.0.12724.12.12.0.0.0.0.161.869.4j4.8.0....0...1c.1.64.img..4.4.432...0j0i24k1.cauhiS1nmUU\n\nhttps://www.google.com/search?q=Obama+is+Hitler&amp;espv=2&amp;rlz=1C1CHMO_enUS570US570&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ved=0ahUKEwjMvKrogu3RAhWjwFQKHf1KAcQQ_AUICSgC&amp;biw=1600&amp;bih=882\n\n\nhttps://www.google.com/search?q=Bill+Clinton+is+hitler&amp;espv=2&amp;rlz=1C1CHMO_enUS570US570&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ved=0ahUKEwj4zcjwgu3RAhVohlQKHdO3AugQ_AUICCgB&amp;biw=1600&amp;bih=882\n\nYou will not find a US president in recent history that was not called Hitler.\n\nMy personal favorite are the tea party ads: http://a57.foxnews.com/images.foxnews.com/content/fox-news/politics/2010/07/13/iowa-tea-party-billboard-compares-obama-hitler/_jcr_content/par/featured-media/media-0.img.jpg/876/493/1421910924462.jpg?ve=1&amp;tl=1\n\nThis last one is a bit ironic, don't you think?","retrieved_on":1486592578,"subreddit_id":"t5_2qh13","author_flair_css_class":null,"author_flair_text":null,"controversiality":0,"link_id":"t3_5r7jvs","created_utc":1485887691,"distinguished":null,"parent_id":"t1_dd5ccgd","edited":false,"id":"dd5jw2r"}{"gilded":0,"stickied":false,"body":"Uh, this is just false. That Hillary Hitler shit was all over conservative media.\n\nhttp://mediamatters.org/video/2006/05/18/savage-jimmy-carter-is-like-hitler/135730\n\nAnd yeah, Carter has been called Hitler.\n\n","subreddit":"worldnews","author":"pizzashill","score":2,"link_id":"t3_5r7jvs","controversiality":1,"author_flair_css_class":null,"author_flair_text":null,"retrieved_on":1486595956,"subreddit_id":"t5_2qh13","created_utc":1485895252,"distinguished":null,"parent_id":"t1_dd5qs96","edited":false,"id":"dd5qwps"}{"distinguished":null,"created_utc":1485895699,"edited":false,"id":"dd5rbr2","parent_id":"t1_dd5r3y0","author":"pizzashill","score":2,"body":"This is a god damn hilarious case of the backfire effect on top of the hostile media effect.\n\n&gt;&gt; Really? All over conservative media?\n\nYes.\n\n&gt;&gt; As for one quote calling Carter \"like Hitler\" (as the article says, specifically because of his criticism of Israeli politics) \n\n**LMAO WHAT?** What do you think the term \"like Hitler\" means? Do you think when people call Trump Hitler they're saying he's **literally** Hitler? No, they're saying he's like Hitler.\n\n&gt;&gt; is not going to circumvent the accusation that you're just cherry-picking the exceptions. The OVERWHELMING Godwin's law verifications have been tilted towards Republicans.\n\nAnd you're wrong. I literally just showed you multiple presidents being called Hitler that are not republicans. \n\nYou're just wrong, and you'll remain wrong. I'm sorry your narrative got destroyed, buttercup. I'm sorry your conservative victim complex got a dose of reality.\n","stickied":false,"gilded":0,"subreddit":"worldnews","author_flair_text":null,"author_flair_css_class":null,"controversiality":1,"subreddit_id":"t5_2qh13","retrieved_on":1486596157,"link_id":"t3_5r7jvs"}{"edited":false,"id":"dd5ruiu","parent_id":"t1_dd5rsp9","distinguished":null,"created_utc":1485896241,"author_flair_text":null,"author_flair_css_class":null,"controversiality":0,"subreddit_id":"t5_2qh13","retrieved_on":1486596408,"link_id":"t3_5r7jvs","author":"pizzashill","score":4,"body":"Go google Hillary is Hitler and tell me what you see.\n\nLiterally thousands.","stickied":false,"gilded":0,"subreddit":"worldnews"}{"link_id":"t3_5r7jvs","subreddit_id":"t5_2qh13","retrieved_on":1486600921,"author_flair_css_class":null,"controversiality":0,"author_flair_text":null,"subreddit":"worldnews","body":"&gt;&gt; You will not find a US president **in recent history** that was not called Hitler.","stickied":false,"gilded":0,"score":1,"author":"pizzashill","parent_id":"t1_dd611rj","edited":false,"id":"dd616d1","created_utc":1485906835,"distinguished":null}